/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const MAX_VER_LEN: u32 = 255;
pub const MAX_CARD_NUM: u32 = 64;
pub const MAX_CHIP_NAME_LEN: u32 = 32;
pub const MAX_LENTH: u32 = 256;
pub const DIE_ID_COUNT: u32 = 5;
pub const MAX_CORE_NUM: u32 = 16;
pub const DCMI_SENSOR_DATA_MAX_LEN: u32 = 16;
pub const DCMI_SENSOR_TEMP_LEN: u32 = 2;
pub const DCMI_SENSOR_NTC_TEMP_LEN: u32 = 4;
pub const DCMI_COMPUTE_GROUP_INFO_RES_NUM: u32 = 8;

pub const DCMI_UTILIZATION_RATE_NPU: u32 = 13;
pub const DCMI_EVENT_FILTER_FLAG_EVENT_ID: u32 = 1;
pub const DCMI_EVENT_FILTER_FLAG_SERVERITY: u32 = 2;
pub const DCMI_EVENT_FILTER_FLAG_NODE_TYPE: u32 = 4;
pub const DCMI_MAX_EVENT_NAME_LENGTH: u32 = 256;
pub const DCMI_MAX_EVENT_DATA_LENGTH: u32 = 32;
pub const DCMI_MAX_EVENT_RESV_LENGTH: u32 = 32;
pub const DCMI_VDEV_RES_NAME_LEN: u32 = 16;
pub const DCMI_VDEV_FOR_RESERVE: u32 = 32;
pub const DCMI_SOC_SPLIT_MAX: u32 = 32;
pub const CERT_NAME_MAX_LEN: u32 = 16;
pub const TIME_LEN: u32 = 32;
pub const CERT_COMMON_NAME_LEN: u32 = 64;
pub const MAX_CERT_COUNT: u32 = 15;
pub const NPU_CERT_MAX_SIZE: u32 = 2048;
pub const DCMI_CERT_SUB_CMD_INIT_TLS_PUB_KEY: u32 = 0;
pub const DCMI_CERT_SUB_CMD_TLS_CERT_INFO: u32 = 2;
pub const CERT_PERIOD_MIN: u32 = 7;
pub const CERT_PERIOD_MAX: u32 = 180;
pub const CERT_CONFIG_EXPIRED: &[u8; 23] = b"cert_expired_threshold\0";
pub const DEFAULT_EXPIERD_THRESHOLD: u32 = 90;
pub const DCMI_POWER_INFO_RESERVE_LEN: u32 = 8;
pub const AGENTDRV_PROF_DATA_NUM: u32 = 3;
pub const SERDES_RESERVED_LEN: u32 = 64;
pub const SERDES_INFO_NUM: u32 = 8;
pub const IP_ADDR_LEN: u32 = 16;
pub const DCMI_PING_PACKET_NUM_MAX: u32 = 1000;
pub const IP_ADRESS_MAX_LEN: u32 = 48;
pub const TRACEROUTE_RESERVE_MAX_LEN: u32 = 64;
pub const DCMI_OK: u32 = 0;
pub const DCMI_ERROR_CODE_BASE: i32 = -8000;
pub const DCMI_ERR_CODE_INVALID_PARAMETER: i32 = -8001;
pub const DCMI_ERR_CODE_OPER_NOT_PERMITTED: i32 = -8002;
pub const DCMI_ERR_CODE_MEM_OPERATE_FAIL: i32 = -8003;
pub const DCMI_ERR_CODE_SECURE_FUN_FAIL: i32 = -8004;
pub const DCMI_ERR_CODE_INNER_ERR: i32 = -8005;
pub const DCMI_ERR_CODE_TIME_OUT: i32 = -8006;
pub const DCMI_ERR_CODE_INVALID_DEVICE_ID: i32 = -8007;
pub const DCMI_ERR_CODE_DEVICE_NOT_EXIST: i32 = -8008;
pub const DCMI_ERR_CODE_IOCTL_FAIL: i32 = -8009;
pub const DCMI_ERR_CODE_SEND_MSG_FAIL: i32 = -8010;
pub const DCMI_ERR_CODE_RECV_MSG_FAIL: i32 = -8011;
pub const DCMI_ERR_CODE_NOT_REDAY: i32 = -8012;
pub const DCMI_ERR_CODE_NOT_SUPPORT_IN_CONTAINER: i32 = -8013;
pub const DCMI_ERR_CODE_FILE_OPERATE_FAIL: i32 = -8014;
pub const DCMI_ERR_CODE_RESET_FAIL: i32 = -8015;
pub const DCMI_ERR_CODE_ABORT_OPERATE: i32 = -8016;
pub const DCMI_ERR_CODE_IS_UPGRADING: i32 = -8017;
pub const DCMI_ERR_CODE_RESOURCE_OCCUPIED: i32 = -8020;
pub const DCMI_ERR_CODE_PARTITION_NOT_RIGHT: i32 = -8022;
pub const DCMI_ERR_CODE_CONFIG_INFO_NOT_EXIST: i32 = -8023;
pub const DCMI_ERR_CODE_NOT_SUPPORT: i32 = -8255;
pub const DMS_MAX_EVENT_NAME_LENGTH: u32 = 256;
pub const DMS_MAX_EVENT_DATA_LENGTH: u32 = 32;
pub const DMS_MAX_EVENT_RESV_LENGTH: u32 = 32;
pub const TAISHAN_CORE_NUM: u32 = 16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_chip_info {
    pub chip_type: [::std::os::raw::c_uchar; 32usize],
    pub chip_name: [::std::os::raw::c_uchar; 32usize],
    pub chip_ver: [::std::os::raw::c_uchar; 32usize],
    pub aicore_cnt: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_chip_info"][::std::mem::size_of::<dcmi_chip_info>() - 100usize];
    ["Alignment of dcmi_chip_info"][::std::mem::align_of::<dcmi_chip_info>() - 4usize];
    ["Offset of field: dcmi_chip_info::chip_type"]
        [::std::mem::offset_of!(dcmi_chip_info, chip_type) - 0usize];
    ["Offset of field: dcmi_chip_info::chip_name"]
        [::std::mem::offset_of!(dcmi_chip_info, chip_name) - 32usize];
    ["Offset of field: dcmi_chip_info::chip_ver"]
        [::std::mem::offset_of!(dcmi_chip_info, chip_ver) - 64usize];
    ["Offset of field: dcmi_chip_info::aicore_cnt"]
        [::std::mem::offset_of!(dcmi_chip_info, aicore_cnt) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_pcie_info {
    pub deviceid: ::std::os::raw::c_uint,
    pub venderid: ::std::os::raw::c_uint,
    pub subvenderid: ::std::os::raw::c_uint,
    pub subdeviceid: ::std::os::raw::c_uint,
    pub bdf_deviceid: ::std::os::raw::c_uint,
    pub bdf_busid: ::std::os::raw::c_uint,
    pub bdf_funcid: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_pcie_info"][::std::mem::size_of::<dcmi_pcie_info>() - 28usize];
    ["Alignment of dcmi_pcie_info"][::std::mem::align_of::<dcmi_pcie_info>() - 4usize];
    ["Offset of field: dcmi_pcie_info::deviceid"]
        [::std::mem::offset_of!(dcmi_pcie_info, deviceid) - 0usize];
    ["Offset of field: dcmi_pcie_info::venderid"]
        [::std::mem::offset_of!(dcmi_pcie_info, venderid) - 4usize];
    ["Offset of field: dcmi_pcie_info::subvenderid"]
        [::std::mem::offset_of!(dcmi_pcie_info, subvenderid) - 8usize];
    ["Offset of field: dcmi_pcie_info::subdeviceid"]
        [::std::mem::offset_of!(dcmi_pcie_info, subdeviceid) - 12usize];
    ["Offset of field: dcmi_pcie_info::bdf_deviceid"]
        [::std::mem::offset_of!(dcmi_pcie_info, bdf_deviceid) - 16usize];
    ["Offset of field: dcmi_pcie_info::bdf_busid"]
        [::std::mem::offset_of!(dcmi_pcie_info, bdf_busid) - 20usize];
    ["Offset of field: dcmi_pcie_info::bdf_funcid"]
        [::std::mem::offset_of!(dcmi_pcie_info, bdf_funcid) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_pcie_info_all {
    pub venderid: ::std::os::raw::c_uint,
    pub subvenderid: ::std::os::raw::c_uint,
    pub deviceid: ::std::os::raw::c_uint,
    pub subdeviceid: ::std::os::raw::c_uint,
    pub domain: ::std::os::raw::c_int,
    pub bdf_busid: ::std::os::raw::c_uint,
    pub bdf_deviceid: ::std::os::raw::c_uint,
    pub bdf_funcid: ::std::os::raw::c_uint,
    pub reserve: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_pcie_info_all"][::std::mem::size_of::<dcmi_pcie_info_all>() - 64usize];
    ["Alignment of dcmi_pcie_info_all"][::std::mem::align_of::<dcmi_pcie_info_all>() - 4usize];
    ["Offset of field: dcmi_pcie_info_all::venderid"]
        [::std::mem::offset_of!(dcmi_pcie_info_all, venderid) - 0usize];
    ["Offset of field: dcmi_pcie_info_all::subvenderid"]
        [::std::mem::offset_of!(dcmi_pcie_info_all, subvenderid) - 4usize];
    ["Offset of field: dcmi_pcie_info_all::deviceid"]
        [::std::mem::offset_of!(dcmi_pcie_info_all, deviceid) - 8usize];
    ["Offset of field: dcmi_pcie_info_all::subdeviceid"]
        [::std::mem::offset_of!(dcmi_pcie_info_all, subdeviceid) - 12usize];
    ["Offset of field: dcmi_pcie_info_all::domain"]
        [::std::mem::offset_of!(dcmi_pcie_info_all, domain) - 16usize];
    ["Offset of field: dcmi_pcie_info_all::bdf_busid"]
        [::std::mem::offset_of!(dcmi_pcie_info_all, bdf_busid) - 20usize];
    ["Offset of field: dcmi_pcie_info_all::bdf_deviceid"]
        [::std::mem::offset_of!(dcmi_pcie_info_all, bdf_deviceid) - 24usize];
    ["Offset of field: dcmi_pcie_info_all::bdf_funcid"]
        [::std::mem::offset_of!(dcmi_pcie_info_all, bdf_funcid) - 28usize];
    ["Offset of field: dcmi_pcie_info_all::reserve"]
        [::std::mem::offset_of!(dcmi_pcie_info_all, reserve) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_board_info {
    pub board_id: ::std::os::raw::c_uint,
    pub pcb_id: ::std::os::raw::c_uint,
    pub bom_id: ::std::os::raw::c_uint,
    pub slot_id: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_board_info"][::std::mem::size_of::<dcmi_board_info>() - 16usize];
    ["Alignment of dcmi_board_info"][::std::mem::align_of::<dcmi_board_info>() - 4usize];
    ["Offset of field: dcmi_board_info::board_id"]
        [::std::mem::offset_of!(dcmi_board_info, board_id) - 0usize];
    ["Offset of field: dcmi_board_info::pcb_id"]
        [::std::mem::offset_of!(dcmi_board_info, pcb_id) - 4usize];
    ["Offset of field: dcmi_board_info::bom_id"]
        [::std::mem::offset_of!(dcmi_board_info, bom_id) - 8usize];
    ["Offset of field: dcmi_board_info::slot_id"]
        [::std::mem::offset_of!(dcmi_board_info, slot_id) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_elabel_info {
    pub product_name: [::std::os::raw::c_char; 256usize],
    pub model: [::std::os::raw::c_char; 256usize],
    pub manufacturer: [::std::os::raw::c_char; 256usize],
    pub manufacturer_date: [::std::os::raw::c_char; 256usize],
    pub serial_number: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_elabel_info"][::std::mem::size_of::<dcmi_elabel_info>() - 1280usize];
    ["Alignment of dcmi_elabel_info"][::std::mem::align_of::<dcmi_elabel_info>() - 1usize];
    ["Offset of field: dcmi_elabel_info::product_name"]
        [::std::mem::offset_of!(dcmi_elabel_info, product_name) - 0usize];
    ["Offset of field: dcmi_elabel_info::model"]
        [::std::mem::offset_of!(dcmi_elabel_info, model) - 256usize];
    ["Offset of field: dcmi_elabel_info::manufacturer"]
        [::std::mem::offset_of!(dcmi_elabel_info, manufacturer) - 512usize];
    ["Offset of field: dcmi_elabel_info::manufacturer_date"]
        [::std::mem::offset_of!(dcmi_elabel_info, manufacturer_date) - 768usize];
    ["Offset of field: dcmi_elabel_info::serial_number"]
        [::std::mem::offset_of!(dcmi_elabel_info, serial_number) - 1024usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_die_id {
    pub soc_die: [::std::os::raw::c_uint; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_die_id"][::std::mem::size_of::<dcmi_die_id>() - 20usize];
    ["Alignment of dcmi_die_id"][::std::mem::align_of::<dcmi_die_id>() - 4usize];
    ["Offset of field: dcmi_die_id::soc_die"]
        [::std::mem::offset_of!(dcmi_die_id, soc_die) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_aicore_info {
    pub freq: ::std::os::raw::c_uint,
    pub cur_freq: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_aicore_info"][::std::mem::size_of::<dcmi_aicore_info>() - 8usize];
    ["Alignment of dcmi_aicore_info"][::std::mem::align_of::<dcmi_aicore_info>() - 4usize];
    ["Offset of field: dcmi_aicore_info::freq"]
        [::std::mem::offset_of!(dcmi_aicore_info, freq) - 0usize];
    ["Offset of field: dcmi_aicore_info::cur_freq"]
        [::std::mem::offset_of!(dcmi_aicore_info, cur_freq) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_aicpu_info {
    pub max_freq: ::std::os::raw::c_uint,
    pub cur_freq: ::std::os::raw::c_uint,
    pub aicpu_num: ::std::os::raw::c_uint,
    pub util_rate: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_aicpu_info"][::std::mem::size_of::<dcmi_aicpu_info>() - 76usize];
    ["Alignment of dcmi_aicpu_info"][::std::mem::align_of::<dcmi_aicpu_info>() - 4usize];
    ["Offset of field: dcmi_aicpu_info::max_freq"]
        [::std::mem::offset_of!(dcmi_aicpu_info, max_freq) - 0usize];
    ["Offset of field: dcmi_aicpu_info::cur_freq"]
        [::std::mem::offset_of!(dcmi_aicpu_info, cur_freq) - 4usize];
    ["Offset of field: dcmi_aicpu_info::aicpu_num"]
        [::std::mem::offset_of!(dcmi_aicpu_info, aicpu_num) - 8usize];
    ["Offset of field: dcmi_aicpu_info::util_rate"]
        [::std::mem::offset_of!(dcmi_aicpu_info, util_rate) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_flash_info {
    pub flash_id: ::std::os::raw::c_ulonglong,
    pub device_id: ::std::os::raw::c_ushort,
    pub vendor: ::std::os::raw::c_ushort,
    pub state: ::std::os::raw::c_uint,
    pub size: ::std::os::raw::c_ulonglong,
    pub sector_count: ::std::os::raw::c_uint,
    pub manufacturer_id: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_flash_info"][::std::mem::size_of::<dcmi_flash_info>() - 32usize];
    ["Alignment of dcmi_flash_info"][::std::mem::align_of::<dcmi_flash_info>() - 8usize];
    ["Offset of field: dcmi_flash_info::flash_id"]
        [::std::mem::offset_of!(dcmi_flash_info, flash_id) - 0usize];
    ["Offset of field: dcmi_flash_info::device_id"]
        [::std::mem::offset_of!(dcmi_flash_info, device_id) - 8usize];
    ["Offset of field: dcmi_flash_info::vendor"]
        [::std::mem::offset_of!(dcmi_flash_info, vendor) - 10usize];
    ["Offset of field: dcmi_flash_info::state"]
        [::std::mem::offset_of!(dcmi_flash_info, state) - 12usize];
    ["Offset of field: dcmi_flash_info::size"]
        [::std::mem::offset_of!(dcmi_flash_info, size) - 16usize];
    ["Offset of field: dcmi_flash_info::sector_count"]
        [::std::mem::offset_of!(dcmi_flash_info, sector_count) - 24usize];
    ["Offset of field: dcmi_flash_info::manufacturer_id"]
        [::std::mem::offset_of!(dcmi_flash_info, manufacturer_id) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_chip_pcie_err_rate {
    pub reg_deskew_fifo_overflow_intr_status: ::std::os::raw::c_uint,
    pub reg_symbol_unlock_intr_status: ::std::os::raw::c_uint,
    pub reg_deskew_unlock_intr_status: ::std::os::raw::c_uint,
    pub reg_phystatus_timeout_intr_status: ::std::os::raw::c_uint,
    pub symbol_unlock_counter: ::std::os::raw::c_uint,
    pub pcs_rx_err_cnt: ::std::os::raw::c_uint,
    pub phy_lane_err_counter: ::std::os::raw::c_uint,
    pub pcs_rcv_err_status: ::std::os::raw::c_uint,
    pub symbol_unlock_err_status: ::std::os::raw::c_uint,
    pub phy_lane_err_status: ::std::os::raw::c_uint,
    pub dl_lcrc_err_num: ::std::os::raw::c_uint,
    pub dl_dcrc_err_num: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_chip_pcie_err_rate"][::std::mem::size_of::<dcmi_chip_pcie_err_rate>() - 48usize];
    ["Alignment of dcmi_chip_pcie_err_rate"]
        [::std::mem::align_of::<dcmi_chip_pcie_err_rate>() - 4usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::reg_deskew_fifo_overflow_intr_status"][::std::mem::offset_of!(
        dcmi_chip_pcie_err_rate,
        reg_deskew_fifo_overflow_intr_status
    ) - 0usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::reg_symbol_unlock_intr_status"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate, reg_symbol_unlock_intr_status) - 4usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::reg_deskew_unlock_intr_status"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate, reg_deskew_unlock_intr_status) - 8usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::reg_phystatus_timeout_intr_status"][::std::mem::offset_of!(
        dcmi_chip_pcie_err_rate,
        reg_phystatus_timeout_intr_status
    ) - 12usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::symbol_unlock_counter"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate, symbol_unlock_counter) - 16usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::pcs_rx_err_cnt"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate, pcs_rx_err_cnt) - 20usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::phy_lane_err_counter"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate, phy_lane_err_counter) - 24usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::pcs_rcv_err_status"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate, pcs_rcv_err_status) - 28usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::symbol_unlock_err_status"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate, symbol_unlock_err_status) - 32usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::phy_lane_err_status"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate, phy_lane_err_status) - 36usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::dl_lcrc_err_num"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate, dl_lcrc_err_num) - 40usize];
    ["Offset of field: dcmi_chip_pcie_err_rate::dl_dcrc_err_num"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate, dl_dcrc_err_num) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ecc_info {
    pub enable_flag: ::std::os::raw::c_int,
    pub single_bit_error_cnt: ::std::os::raw::c_uint,
    pub double_bit_error_cnt: ::std::os::raw::c_uint,
    pub total_single_bit_error_cnt: ::std::os::raw::c_uint,
    pub total_double_bit_error_cnt: ::std::os::raw::c_uint,
    pub single_bit_isolated_pages_cnt: ::std::os::raw::c_uint,
    pub double_bit_isolated_pages_cnt: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ecc_info"][::std::mem::size_of::<dcmi_ecc_info>() - 28usize];
    ["Alignment of dcmi_ecc_info"][::std::mem::align_of::<dcmi_ecc_info>() - 4usize];
    ["Offset of field: dcmi_ecc_info::enable_flag"]
        [::std::mem::offset_of!(dcmi_ecc_info, enable_flag) - 0usize];
    ["Offset of field: dcmi_ecc_info::single_bit_error_cnt"]
        [::std::mem::offset_of!(dcmi_ecc_info, single_bit_error_cnt) - 4usize];
    ["Offset of field: dcmi_ecc_info::double_bit_error_cnt"]
        [::std::mem::offset_of!(dcmi_ecc_info, double_bit_error_cnt) - 8usize];
    ["Offset of field: dcmi_ecc_info::total_single_bit_error_cnt"]
        [::std::mem::offset_of!(dcmi_ecc_info, total_single_bit_error_cnt) - 12usize];
    ["Offset of field: dcmi_ecc_info::total_double_bit_error_cnt"]
        [::std::mem::offset_of!(dcmi_ecc_info, total_double_bit_error_cnt) - 16usize];
    ["Offset of field: dcmi_ecc_info::single_bit_isolated_pages_cnt"]
        [::std::mem::offset_of!(dcmi_ecc_info, single_bit_isolated_pages_cnt) - 20usize];
    ["Offset of field: dcmi_ecc_info::double_bit_isolated_pages_cnt"]
        [::std::mem::offset_of!(dcmi_ecc_info, double_bit_isolated_pages_cnt) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_hbm_info {
    pub memory_size: ::std::os::raw::c_ulonglong,
    pub freq: ::std::os::raw::c_uint,
    pub memory_usage: ::std::os::raw::c_ulonglong,
    pub temp: ::std::os::raw::c_int,
    pub bandwith_util_rate: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_hbm_info"][::std::mem::size_of::<dcmi_hbm_info>() - 32usize];
    ["Alignment of dcmi_hbm_info"][::std::mem::align_of::<dcmi_hbm_info>() - 8usize];
    ["Offset of field: dcmi_hbm_info::memory_size"]
        [::std::mem::offset_of!(dcmi_hbm_info, memory_size) - 0usize];
    ["Offset of field: dcmi_hbm_info::freq"][::std::mem::offset_of!(dcmi_hbm_info, freq) - 8usize];
    ["Offset of field: dcmi_hbm_info::memory_usage"]
        [::std::mem::offset_of!(dcmi_hbm_info, memory_usage) - 16usize];
    ["Offset of field: dcmi_hbm_info::temp"][::std::mem::offset_of!(dcmi_hbm_info, temp) - 24usize];
    ["Offset of field: dcmi_hbm_info::bandwith_util_rate"]
        [::std::mem::offset_of!(dcmi_hbm_info, bandwith_util_rate) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_memory_info {
    pub memory_size: ::std::os::raw::c_ulonglong,
    pub freq: ::std::os::raw::c_uint,
    pub utiliza: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_memory_info"][::std::mem::size_of::<dcmi_memory_info>() - 16usize];
    ["Alignment of dcmi_memory_info"][::std::mem::align_of::<dcmi_memory_info>() - 8usize];
    ["Offset of field: dcmi_memory_info::memory_size"]
        [::std::mem::offset_of!(dcmi_memory_info, memory_size) - 0usize];
    ["Offset of field: dcmi_memory_info::freq"]
        [::std::mem::offset_of!(dcmi_memory_info, freq) - 8usize];
    ["Offset of field: dcmi_memory_info::utiliza"]
        [::std::mem::offset_of!(dcmi_memory_info, utiliza) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_get_memory_info_stru {
    pub memory_size: ::std::os::raw::c_ulonglong,
    pub memory_available: ::std::os::raw::c_ulonglong,
    pub freq: ::std::os::raw::c_uint,
    pub hugepagesize: ::std::os::raw::c_ulong,
    pub hugepages_total: ::std::os::raw::c_ulong,
    pub hugepages_free: ::std::os::raw::c_ulong,
    pub utiliza: ::std::os::raw::c_uint,
    pub reserve: [::std::os::raw::c_uchar; 60usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_get_memory_info_stru"]
        [::std::mem::size_of::<dcmi_get_memory_info_stru>() - 112usize];
    ["Alignment of dcmi_get_memory_info_stru"]
        [::std::mem::align_of::<dcmi_get_memory_info_stru>() - 8usize];
    ["Offset of field: dcmi_get_memory_info_stru::memory_size"]
        [::std::mem::offset_of!(dcmi_get_memory_info_stru, memory_size) - 0usize];
    ["Offset of field: dcmi_get_memory_info_stru::memory_available"]
        [::std::mem::offset_of!(dcmi_get_memory_info_stru, memory_available) - 8usize];
    ["Offset of field: dcmi_get_memory_info_stru::freq"]
        [::std::mem::offset_of!(dcmi_get_memory_info_stru, freq) - 16usize];
    ["Offset of field: dcmi_get_memory_info_stru::hugepagesize"]
        [::std::mem::offset_of!(dcmi_get_memory_info_stru, hugepagesize) - 24usize];
    ["Offset of field: dcmi_get_memory_info_stru::hugepages_total"]
        [::std::mem::offset_of!(dcmi_get_memory_info_stru, hugepages_total) - 32usize];
    ["Offset of field: dcmi_get_memory_info_stru::hugepages_free"]
        [::std::mem::offset_of!(dcmi_get_memory_info_stru, hugepages_free) - 40usize];
    ["Offset of field: dcmi_get_memory_info_stru::utiliza"]
        [::std::mem::offset_of!(dcmi_get_memory_info_stru, utiliza) - 48usize];
    ["Offset of field: dcmi_get_memory_info_stru::reserve"]
        [::std::mem::offset_of!(dcmi_get_memory_info_stru, reserve) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_hbm_product_info {
    pub manufacturer_id: ::std::os::raw::c_ushort,
    pub reserve: [::std::os::raw::c_uchar; 62usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_hbm_product_info"][::std::mem::size_of::<dcmi_hbm_product_info>() - 64usize];
    ["Alignment of dcmi_hbm_product_info"]
        [::std::mem::align_of::<dcmi_hbm_product_info>() - 2usize];
    ["Offset of field: dcmi_hbm_product_info::manufacturer_id"]
        [::std::mem::offset_of!(dcmi_hbm_product_info, manufacturer_id) - 0usize];
    ["Offset of field: dcmi_hbm_product_info::reserve"]
        [::std::mem::offset_of!(dcmi_hbm_product_info, reserve) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_dvpp_ratio {
    pub vdec_ratio: ::std::os::raw::c_int,
    pub vpc_ratio: ::std::os::raw::c_int,
    pub venc_ratio: ::std::os::raw::c_int,
    pub jpege_ratio: ::std::os::raw::c_int,
    pub jpegd_ratio: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_dvpp_ratio"][::std::mem::size_of::<dcmi_dvpp_ratio>() - 20usize];
    ["Alignment of dcmi_dvpp_ratio"][::std::mem::align_of::<dcmi_dvpp_ratio>() - 4usize];
    ["Offset of field: dcmi_dvpp_ratio::vdec_ratio"]
        [::std::mem::offset_of!(dcmi_dvpp_ratio, vdec_ratio) - 0usize];
    ["Offset of field: dcmi_dvpp_ratio::vpc_ratio"]
        [::std::mem::offset_of!(dcmi_dvpp_ratio, vpc_ratio) - 4usize];
    ["Offset of field: dcmi_dvpp_ratio::venc_ratio"]
        [::std::mem::offset_of!(dcmi_dvpp_ratio, venc_ratio) - 8usize];
    ["Offset of field: dcmi_dvpp_ratio::jpege_ratio"]
        [::std::mem::offset_of!(dcmi_dvpp_ratio, jpege_ratio) - 12usize];
    ["Offset of field: dcmi_dvpp_ratio::jpegd_ratio"]
        [::std::mem::offset_of!(dcmi_dvpp_ratio, jpegd_ratio) - 16usize];
};
pub const SM_KEY_TYPE_SM3_NORMAL_SUMMARY: SM_KEY_TYPE = 0;
pub const SM_KEY_TYPE_SM4_CBC_ENCRYPT: SM_KEY_TYPE = 1;
pub const SM_KEY_TYPE_SM4_CBC_DECRYPT: SM_KEY_TYPE = 2;
pub type SM_KEY_TYPE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_sm_parm {
    pub key_type: ::std::os::raw::c_uint,
    pub key_len: ::std::os::raw::c_uint,
    pub iv_len: ::std::os::raw::c_uint,
    pub reserves: ::std::os::raw::c_uint,
    pub iv: [::std::os::raw::c_uchar; 64usize],
    pub key: [::std::os::raw::c_uchar; 512usize],
    pub reserved: [::std::os::raw::c_uchar; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_sm_parm"][::std::mem::size_of::<dcmi_sm_parm>() - 1104usize];
    ["Alignment of dcmi_sm_parm"][::std::mem::align_of::<dcmi_sm_parm>() - 4usize];
    ["Offset of field: dcmi_sm_parm::key_type"]
        [::std::mem::offset_of!(dcmi_sm_parm, key_type) - 0usize];
    ["Offset of field: dcmi_sm_parm::key_len"]
        [::std::mem::offset_of!(dcmi_sm_parm, key_len) - 4usize];
    ["Offset of field: dcmi_sm_parm::iv_len"]
        [::std::mem::offset_of!(dcmi_sm_parm, iv_len) - 8usize];
    ["Offset of field: dcmi_sm_parm::reserves"]
        [::std::mem::offset_of!(dcmi_sm_parm, reserves) - 12usize];
    ["Offset of field: dcmi_sm_parm::iv"][::std::mem::offset_of!(dcmi_sm_parm, iv) - 16usize];
    ["Offset of field: dcmi_sm_parm::key"][::std::mem::offset_of!(dcmi_sm_parm, key) - 80usize];
    ["Offset of field: dcmi_sm_parm::reserved"]
        [::std::mem::offset_of!(dcmi_sm_parm, reserved) - 592usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_sm_data {
    pub in_buf: *const ::std::os::raw::c_uchar,
    pub in_len: ::std::os::raw::c_uint,
    pub out_buf: *mut ::std::os::raw::c_uchar,
    pub out_len: *mut ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_sm_data"][::std::mem::size_of::<dcmi_sm_data>() - 32usize];
    ["Alignment of dcmi_sm_data"][::std::mem::align_of::<dcmi_sm_data>() - 8usize];
    ["Offset of field: dcmi_sm_data::in_buf"]
        [::std::mem::offset_of!(dcmi_sm_data, in_buf) - 0usize];
    ["Offset of field: dcmi_sm_data::in_len"]
        [::std::mem::offset_of!(dcmi_sm_data, in_len) - 8usize];
    ["Offset of field: dcmi_sm_data::out_buf"]
        [::std::mem::offset_of!(dcmi_sm_data, out_buf) - 16usize];
    ["Offset of field: dcmi_sm_data::out_len"]
        [::std::mem::offset_of!(dcmi_sm_data, out_len) - 24usize];
};
pub const DCMI_TS_ID_DCMI_TS_AICORE: DCMI_TS_ID = 0;
pub const DCMI_TS_ID_DCMI_TS_AIVECTOR: DCMI_TS_ID = 1;
pub type DCMI_TS_ID = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_capability_group_info {
    pub group_id: ::std::os::raw::c_uint,
    pub state: ::std::os::raw::c_uint,
    pub extend_attribute: ::std::os::raw::c_uint,
    pub aicore_number: ::std::os::raw::c_uint,
    pub aivector_number: ::std::os::raw::c_uint,
    pub sdma_number: ::std::os::raw::c_uint,
    pub aicpu_number: ::std::os::raw::c_uint,
    pub active_sq_number: ::std::os::raw::c_uint,
    pub aicore_mask: [::std::os::raw::c_uint; 2usize],
    pub res: [::std::os::raw::c_uint; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_capability_group_info"]
        [::std::mem::size_of::<dcmi_capability_group_info>() - 64usize];
    ["Alignment of dcmi_capability_group_info"]
        [::std::mem::align_of::<dcmi_capability_group_info>() - 4usize];
    ["Offset of field: dcmi_capability_group_info::group_id"]
        [::std::mem::offset_of!(dcmi_capability_group_info, group_id) - 0usize];
    ["Offset of field: dcmi_capability_group_info::state"]
        [::std::mem::offset_of!(dcmi_capability_group_info, state) - 4usize];
    ["Offset of field: dcmi_capability_group_info::extend_attribute"]
        [::std::mem::offset_of!(dcmi_capability_group_info, extend_attribute) - 8usize];
    ["Offset of field: dcmi_capability_group_info::aicore_number"]
        [::std::mem::offset_of!(dcmi_capability_group_info, aicore_number) - 12usize];
    ["Offset of field: dcmi_capability_group_info::aivector_number"]
        [::std::mem::offset_of!(dcmi_capability_group_info, aivector_number) - 16usize];
    ["Offset of field: dcmi_capability_group_info::sdma_number"]
        [::std::mem::offset_of!(dcmi_capability_group_info, sdma_number) - 20usize];
    ["Offset of field: dcmi_capability_group_info::aicpu_number"]
        [::std::mem::offset_of!(dcmi_capability_group_info, aicpu_number) - 24usize];
    ["Offset of field: dcmi_capability_group_info::active_sq_number"]
        [::std::mem::offset_of!(dcmi_capability_group_info, active_sq_number) - 28usize];
    ["Offset of field: dcmi_capability_group_info::aicore_mask"]
        [::std::mem::offset_of!(dcmi_capability_group_info, aicore_mask) - 32usize];
    ["Offset of field: dcmi_capability_group_info::res"]
        [::std::mem::offset_of!(dcmi_capability_group_info, res) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_cgroup_info {
    pub limit_in_bytes: ::std::os::raw::c_ulong,
    pub max_usage_in_bytes: ::std::os::raw::c_ulong,
    pub usage_in_bytes: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_cgroup_info"][::std::mem::size_of::<dcmi_cgroup_info>() - 24usize];
    ["Alignment of dcmi_cgroup_info"][::std::mem::align_of::<dcmi_cgroup_info>() - 8usize];
    ["Offset of field: dcmi_cgroup_info::limit_in_bytes"]
        [::std::mem::offset_of!(dcmi_cgroup_info, limit_in_bytes) - 0usize];
    ["Offset of field: dcmi_cgroup_info::max_usage_in_bytes"]
        [::std::mem::offset_of!(dcmi_cgroup_info, max_usage_in_bytes) - 8usize];
    ["Offset of field: dcmi_cgroup_info::usage_in_bytes"]
        [::std::mem::offset_of!(dcmi_cgroup_info, usage_in_bytes) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_llc_perf {
    pub wr_hit_rate: ::std::os::raw::c_uint,
    pub rd_hit_rate: ::std::os::raw::c_uint,
    pub throughput: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_llc_perf"][::std::mem::size_of::<dcmi_llc_perf>() - 12usize];
    ["Alignment of dcmi_llc_perf"][::std::mem::align_of::<dcmi_llc_perf>() - 4usize];
    ["Offset of field: dcmi_llc_perf::wr_hit_rate"]
        [::std::mem::offset_of!(dcmi_llc_perf, wr_hit_rate) - 0usize];
    ["Offset of field: dcmi_llc_perf::rd_hit_rate"]
        [::std::mem::offset_of!(dcmi_llc_perf, rd_hit_rate) - 4usize];
    ["Offset of field: dcmi_llc_perf::throughput"]
        [::std::mem::offset_of!(dcmi_llc_perf, throughput) - 8usize];
};
pub const dcmi_ip_addr_type_DCMI_IPADDR_TYPE_V4: dcmi_ip_addr_type = 0;
#[doc = " IPv4"]
pub const dcmi_ip_addr_type_DCMI_IPADDR_TYPE_V6: dcmi_ip_addr_type = 1;
#[doc = " IPv6"]
pub const dcmi_ip_addr_type_DCMI_IPADDR_TYPE_ANY: dcmi_ip_addr_type = 2;
pub type dcmi_ip_addr_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dcmi_ip_addr {
    pub u_addr: dcmi_ip_addr__bindgen_ty_1,
    pub ip_type: dcmi_ip_addr_type,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dcmi_ip_addr__bindgen_ty_1 {
    pub ip6: [::std::os::raw::c_uchar; 16usize],
    pub ip4: [::std::os::raw::c_uchar; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ip_addr__bindgen_ty_1"]
        [::std::mem::size_of::<dcmi_ip_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of dcmi_ip_addr__bindgen_ty_1"]
        [::std::mem::align_of::<dcmi_ip_addr__bindgen_ty_1>() - 1usize];
    ["Offset of field: dcmi_ip_addr__bindgen_ty_1::ip6"]
        [::std::mem::offset_of!(dcmi_ip_addr__bindgen_ty_1, ip6) - 0usize];
    ["Offset of field: dcmi_ip_addr__bindgen_ty_1::ip4"]
        [::std::mem::offset_of!(dcmi_ip_addr__bindgen_ty_1, ip4) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ip_addr"][::std::mem::size_of::<dcmi_ip_addr>() - 20usize];
    ["Alignment of dcmi_ip_addr"][::std::mem::align_of::<dcmi_ip_addr>() - 4usize];
    ["Offset of field: dcmi_ip_addr::u_addr"]
        [::std::mem::offset_of!(dcmi_ip_addr, u_addr) - 0usize];
    ["Offset of field: dcmi_ip_addr::ip_type"]
        [::std::mem::offset_of!(dcmi_ip_addr, ip_type) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_proc_mem_info {
    pub proc_id: ::std::os::raw::c_int,
    pub proc_mem_usage: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_proc_mem_info"][::std::mem::size_of::<dcmi_proc_mem_info>() - 16usize];
    ["Alignment of dcmi_proc_mem_info"][::std::mem::align_of::<dcmi_proc_mem_info>() - 8usize];
    ["Offset of field: dcmi_proc_mem_info::proc_id"]
        [::std::mem::offset_of!(dcmi_proc_mem_info, proc_id) - 0usize];
    ["Offset of field: dcmi_proc_mem_info::proc_mem_usage"]
        [::std::mem::offset_of!(dcmi_proc_mem_info, proc_mem_usage) - 8usize];
};
pub const dcmi_reset_channel_OUTBAND_CHANNEL: dcmi_reset_channel = 0;
pub const dcmi_reset_channel_INBAND_CHANNEL: dcmi_reset_channel = 1;
pub type dcmi_reset_channel = ::std::os::raw::c_uint;
pub const dcmi_unit_type_NPU_TYPE: dcmi_unit_type = 0;
pub const dcmi_unit_type_MCU_TYPE: dcmi_unit_type = 1;
pub const dcmi_unit_type_CPU_TYPE: dcmi_unit_type = 2;
pub const dcmi_unit_type_INVALID_TYPE: dcmi_unit_type = 255;
pub type dcmi_unit_type = ::std::os::raw::c_uint;
pub const dcmi_die_type_NDIE: dcmi_die_type = 0;
pub const dcmi_die_type_VDIE: dcmi_die_type = 1;
pub type dcmi_die_type = ::std::os::raw::c_uint;
pub const dcmi_rdfx_detect_result_DCMI_RDFX_DETECT_OK: dcmi_rdfx_detect_result = 0;
pub const dcmi_rdfx_detect_result_DCMI_RDFX_DETECT_SOCK_FAIL: dcmi_rdfx_detect_result = 1;
pub const dcmi_rdfx_detect_result_DCMI_RDFX_DETECT_RECV_TIMEOUT: dcmi_rdfx_detect_result = 2;
pub const dcmi_rdfx_detect_result_DCMI_RDFX_DETECT_UNREACH: dcmi_rdfx_detect_result = 3;
pub const dcmi_rdfx_detect_result_DCMI_RDFX_DETECT_TIME_EXCEEDED: dcmi_rdfx_detect_result = 4;
pub const dcmi_rdfx_detect_result_DCMI_RDFX_DETECT_FAULT: dcmi_rdfx_detect_result = 5;
pub const dcmi_rdfx_detect_result_DCMI_RDFX_DETECT_INIT: dcmi_rdfx_detect_result = 6;
pub const dcmi_rdfx_detect_result_DCMI_RDFX_DETECT_THREAD_ERR: dcmi_rdfx_detect_result = 7;
pub const dcmi_rdfx_detect_result_DCMI_RDFX_DETECT_IP_SET: dcmi_rdfx_detect_result = 8;
pub const dcmi_rdfx_detect_result_DCMI_RDFX_DETECT_MAX: dcmi_rdfx_detect_result = 255;
pub type dcmi_rdfx_detect_result = ::std::os::raw::c_uint;
pub const dcmi_device_compat_DCMI_COMPAT_OK: dcmi_device_compat = 1;
pub const dcmi_device_compat_DCMI_COMPAT_NOK: dcmi_device_compat = 2;
pub const dcmi_device_compat_DCMI_COMPAT_UNKNOWN: dcmi_device_compat = 3;
pub type dcmi_device_compat = ::std::os::raw::c_uint;
pub const dcmi_port_type_DCMI_VNIC_PORT: dcmi_port_type = 0;
pub const dcmi_port_type_DCMI_ROCE_PORT: dcmi_port_type = 1;
pub const dcmi_port_type_DCMI_INVALID_PORT: dcmi_port_type = 2;
pub type dcmi_port_type = ::std::os::raw::c_uint;
pub const dcmi_revo_type_DCMI_REVOCATION_TYPE_SOC: dcmi_revo_type = 0;
pub const dcmi_revo_type_DCMI_REVOCATION_TYPE_CMS_CRL: dcmi_revo_type = 1;
pub const dcmi_revo_type_DCMI_REVOCATION_TYPE_CMS_CRL_EXT: dcmi_revo_type = 2;
pub const dcmi_revo_type_DCMI_REVOCATION_TYPE_MAX: dcmi_revo_type = 3;
pub type dcmi_revo_type = ::std::os::raw::c_uint;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_DVPP: dcmi_main_cmd = 0;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_ISP: dcmi_main_cmd = 1;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_TS_GROUP_NUM: dcmi_main_cmd = 2;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_CAN: dcmi_main_cmd = 3;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_UART: dcmi_main_cmd = 4;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_UPGRADE: dcmi_main_cmd = 5;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_UFS: dcmi_main_cmd = 6;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_OS_POWER: dcmi_main_cmd = 7;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_LP: dcmi_main_cmd = 8;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_MEMORY: dcmi_main_cmd = 9;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_RECOVERY: dcmi_main_cmd = 10;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_TS: dcmi_main_cmd = 11;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_CHIP_INF: dcmi_main_cmd = 12;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_QOS: dcmi_main_cmd = 13;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_SOC_INFO: dcmi_main_cmd = 14;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_SILS: dcmi_main_cmd = 15;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_HCCS: dcmi_main_cmd = 16;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_HOST_AICPU: dcmi_main_cmd = 17;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_TEMP: dcmi_main_cmd = 50;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_SVM: dcmi_main_cmd = 51;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_VDEV_MNG: dcmi_main_cmd = 52;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_SEC: dcmi_main_cmd = 53;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_SIO: dcmi_main_cmd = 56;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_EX_COMPUTING: dcmi_main_cmd = 32768;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_DEVICE_SHARE: dcmi_main_cmd = 32769;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_EX_CERT: dcmi_main_cmd = 32771;
pub const dcmi_main_cmd_DCMI_MAIN_CMD_MAX: dcmi_main_cmd = 32772;
pub type dcmi_main_cmd = ::std::os::raw::c_uint;
pub const DCMI_HOST_AICPU_SUB_CMD_DCMI_SUB_CMD_HOST_AICPU_INFO: DCMI_HOST_AICPU_SUB_CMD = 0;
pub type DCMI_HOST_AICPU_SUB_CMD = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_host_aicpu_info {
    pub num: ::std::os::raw::c_uint,
    pub bitmap: [::std::os::raw::c_ulonglong; 8usize],
    pub work_mode: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uchar; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_host_aicpu_info"][::std::mem::size_of::<dcmi_host_aicpu_info>() - 96usize];
    ["Alignment of dcmi_host_aicpu_info"][::std::mem::align_of::<dcmi_host_aicpu_info>() - 8usize];
    ["Offset of field: dcmi_host_aicpu_info::num"]
        [::std::mem::offset_of!(dcmi_host_aicpu_info, num) - 0usize];
    ["Offset of field: dcmi_host_aicpu_info::bitmap"]
        [::std::mem::offset_of!(dcmi_host_aicpu_info, bitmap) - 8usize];
    ["Offset of field: dcmi_host_aicpu_info::work_mode"]
        [::std::mem::offset_of!(dcmi_host_aicpu_info, work_mode) - 72usize];
    ["Offset of field: dcmi_host_aicpu_info::reserved"]
        [::std::mem::offset_of!(dcmi_host_aicpu_info, reserved) - 76usize];
};
pub const DCMI_HCCS_SUB_CMD_DCMI_HCCS_CMD_GET_STATUS: DCMI_HCCS_SUB_CMD = 0;
pub const DCMI_HCCS_SUB_CMD_DCMI_HCCS_CMD_GET_LANE_INFO: DCMI_HCCS_SUB_CMD = 1;
pub const DCMI_HCCS_SUB_CMD_DCMI_HCCS_CMD_GET_STATISTIC_INFO: DCMI_HCCS_SUB_CMD = 3;
pub const DCMI_HCCS_SUB_CMD_DCMI_HCCS_CMD_MAX: DCMI_HCCS_SUB_CMD = 4;
pub type DCMI_HCCS_SUB_CMD = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_hccs_lane_info {
    pub hccs_port_pcs_bitmap: ::std::os::raw::c_uint,
    pub pcs_lane_bitmap: [::std::os::raw::c_uint; 16usize],
    pub reserve: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_hccs_lane_info"][::std::mem::size_of::<dcmi_hccs_lane_info>() - 132usize];
    ["Alignment of dcmi_hccs_lane_info"][::std::mem::align_of::<dcmi_hccs_lane_info>() - 4usize];
    ["Offset of field: dcmi_hccs_lane_info::hccs_port_pcs_bitmap"]
        [::std::mem::offset_of!(dcmi_hccs_lane_info, hccs_port_pcs_bitmap) - 0usize];
    ["Offset of field: dcmi_hccs_lane_info::pcs_lane_bitmap"]
        [::std::mem::offset_of!(dcmi_hccs_lane_info, pcs_lane_bitmap) - 4usize];
    ["Offset of field: dcmi_hccs_lane_info::reserve"]
        [::std::mem::offset_of!(dcmi_hccs_lane_info, reserve) - 68usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_hccs_statistic_info {
    pub tx_cnt: [::std::os::raw::c_uint; 16usize],
    pub rx_cnt: [::std::os::raw::c_uint; 16usize],
    pub crc_err_cnt: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_hccs_statistic_info"]
        [::std::mem::size_of::<dcmi_hccs_statistic_info>() - 192usize];
    ["Alignment of dcmi_hccs_statistic_info"]
        [::std::mem::align_of::<dcmi_hccs_statistic_info>() - 4usize];
    ["Offset of field: dcmi_hccs_statistic_info::tx_cnt"]
        [::std::mem::offset_of!(dcmi_hccs_statistic_info, tx_cnt) - 0usize];
    ["Offset of field: dcmi_hccs_statistic_info::rx_cnt"]
        [::std::mem::offset_of!(dcmi_hccs_statistic_info, rx_cnt) - 64usize];
    ["Offset of field: dcmi_hccs_statistic_info::crc_err_cnt"]
        [::std::mem::offset_of!(dcmi_hccs_statistic_info, crc_err_cnt) - 128usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_hccs_statues {
    pub pcs_status: ::std::os::raw::c_uint,
    pub reserve: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_hccs_statues"][::std::mem::size_of::<dcmi_hccs_statues>() - 12usize];
    ["Alignment of dcmi_hccs_statues"][::std::mem::align_of::<dcmi_hccs_statues>() - 4usize];
    ["Offset of field: dcmi_hccs_statues::pcs_status"]
        [::std::mem::offset_of!(dcmi_hccs_statues, pcs_status) - 0usize];
    ["Offset of field: dcmi_hccs_statues::reserve"]
        [::std::mem::offset_of!(dcmi_hccs_statues, reserve) - 4usize];
};
pub const DCMI_SIO_SUB_CMD_DCMI_SIO_SUB_CMD_CRC_ERR_STATISTICS: DCMI_SIO_SUB_CMD = 0;
pub type DCMI_SIO_SUB_CMD = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_sio_crc_err_statistics_info {
    pub tx_error_count: ::std::os::raw::c_ushort,
    pub rx_error_count: ::std::os::raw::c_ushort,
    pub reserved: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_sio_crc_err_statistics_info"]
        [::std::mem::size_of::<dcmi_sio_crc_err_statistics_info>() - 12usize];
    ["Alignment of dcmi_sio_crc_err_statistics_info"]
        [::std::mem::align_of::<dcmi_sio_crc_err_statistics_info>() - 2usize];
    ["Offset of field: dcmi_sio_crc_err_statistics_info::tx_error_count"]
        [::std::mem::offset_of!(dcmi_sio_crc_err_statistics_info, tx_error_count) - 0usize];
    ["Offset of field: dcmi_sio_crc_err_statistics_info::rx_error_count"]
        [::std::mem::offset_of!(dcmi_sio_crc_err_statistics_info, rx_error_count) - 2usize];
    ["Offset of field: dcmi_sio_crc_err_statistics_info::reserved"]
        [::std::mem::offset_of!(dcmi_sio_crc_err_statistics_info, reserved) - 4usize];
};
pub const DCMI_SILS_SUB_CMD_DCMI_SILS_SUB_CMD_PMUWDG_DISABLE: DCMI_SILS_SUB_CMD = 0;
pub const DCMI_SILS_SUB_CMD_DCMI_SILS_SUB_CMD_PMUWDG_ENABLE: DCMI_SILS_SUB_CMD = 1;
pub const DCMI_SILS_SUB_CMD_DCMI_SILS_SUB_CMD_PMUWDG_STATUS: DCMI_SILS_SUB_CMD = 2;
pub const DCMI_SILS_SUB_CMD_DCMI_SILS_SUB_CMD_INVALID: DCMI_SILS_SUB_CMD = 255;
pub type DCMI_SILS_SUB_CMD = ::std::os::raw::c_uint;
pub const DCMI_SOC_INFO_SUB_CMD_DCMI_SOC_INFO_SUB_CMD_DOMAIN_INFO: DCMI_SOC_INFO_SUB_CMD = 0;
pub const DCMI_SOC_INFO_SUB_CMD_DCMI_SOC_INFO_SUB_CMD_MAX: DCMI_SOC_INFO_SUB_CMD = 1;
pub type DCMI_SOC_INFO_SUB_CMD = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_domain_info {
    pub ai_cpu_num: ::std::os::raw::c_int,
    pub ctrl_cpu_num: ::std::os::raw::c_int,
    pub data_cpu_num: ::std::os::raw::c_int,
    pub ai_core_num: ::std::os::raw::c_int,
    pub vector_core_num: ::std::os::raw::c_int,
    pub reserve: [::std::os::raw::c_int; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_domain_info"][::std::mem::size_of::<dcmi_domain_info>() - 52usize];
    ["Alignment of dcmi_domain_info"][::std::mem::align_of::<dcmi_domain_info>() - 4usize];
    ["Offset of field: dcmi_domain_info::ai_cpu_num"]
        [::std::mem::offset_of!(dcmi_domain_info, ai_cpu_num) - 0usize];
    ["Offset of field: dcmi_domain_info::ctrl_cpu_num"]
        [::std::mem::offset_of!(dcmi_domain_info, ctrl_cpu_num) - 4usize];
    ["Offset of field: dcmi_domain_info::data_cpu_num"]
        [::std::mem::offset_of!(dcmi_domain_info, data_cpu_num) - 8usize];
    ["Offset of field: dcmi_domain_info::ai_core_num"]
        [::std::mem::offset_of!(dcmi_domain_info, ai_core_num) - 12usize];
    ["Offset of field: dcmi_domain_info::vector_core_num"]
        [::std::mem::offset_of!(dcmi_domain_info, vector_core_num) - 16usize];
    ["Offset of field: dcmi_domain_info::reserve"]
        [::std::mem::offset_of!(dcmi_domain_info, reserve) - 20usize];
};
pub const DCMI_QOS_SUB_INFO_DCMI_QOS_SUB_MATA_CONFIG: DCMI_QOS_SUB_INFO = 0;
pub const DCMI_QOS_SUB_INFO_DCMI_QOS_SUB_MASTER_CONFIG: DCMI_QOS_SUB_INFO = 1;
pub const DCMI_QOS_SUB_INFO_DCMI_QOS_SUB_BW_DATA: DCMI_QOS_SUB_INFO = 2;
pub const DCMI_QOS_SUB_INFO_DCMI_QOS_SUB_GLOBAL_CONFIG: DCMI_QOS_SUB_INFO = 3;
pub const DCMI_QOS_SUB_INFO_DCMI_QOS_SUB_CONFIG_DONE: DCMI_QOS_SUB_INFO = 4;
pub type DCMI_QOS_SUB_INFO = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_qos_bw_config {
    pub mode: ::std::os::raw::c_uchar,
    pub state: ::std::os::raw::c_uchar,
    pub cnt: ::std::os::raw::c_uchar,
    pub method: ::std::os::raw::c_uchar,
    pub interval: ::std::os::raw::c_uint,
    pub target_set: [::std::os::raw::c_uint; 16usize],
    pub reserved_1: [::std::os::raw::c_int; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_qos_bw_config"][::std::mem::size_of::<dcmi_qos_bw_config>() - 104usize];
    ["Alignment of dcmi_qos_bw_config"][::std::mem::align_of::<dcmi_qos_bw_config>() - 4usize];
    ["Offset of field: dcmi_qos_bw_config::mode"]
        [::std::mem::offset_of!(dcmi_qos_bw_config, mode) - 0usize];
    ["Offset of field: dcmi_qos_bw_config::state"]
        [::std::mem::offset_of!(dcmi_qos_bw_config, state) - 1usize];
    ["Offset of field: dcmi_qos_bw_config::cnt"]
        [::std::mem::offset_of!(dcmi_qos_bw_config, cnt) - 2usize];
    ["Offset of field: dcmi_qos_bw_config::method"]
        [::std::mem::offset_of!(dcmi_qos_bw_config, method) - 3usize];
    ["Offset of field: dcmi_qos_bw_config::interval"]
        [::std::mem::offset_of!(dcmi_qos_bw_config, interval) - 4usize];
    ["Offset of field: dcmi_qos_bw_config::target_set"]
        [::std::mem::offset_of!(dcmi_qos_bw_config, target_set) - 8usize];
    ["Offset of field: dcmi_qos_bw_config::reserved_1"]
        [::std::mem::offset_of!(dcmi_qos_bw_config, reserved_1) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_qos_bw_result {
    pub mpamid: ::std::os::raw::c_int,
    pub curr: ::std::os::raw::c_uint,
    pub bw_max: ::std::os::raw::c_uint,
    pub bw_min: ::std::os::raw::c_uint,
    pub bw_mean: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_int; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_qos_bw_result"][::std::mem::size_of::<dcmi_qos_bw_result>() - 52usize];
    ["Alignment of dcmi_qos_bw_result"][::std::mem::align_of::<dcmi_qos_bw_result>() - 4usize];
    ["Offset of field: dcmi_qos_bw_result::mpamid"]
        [::std::mem::offset_of!(dcmi_qos_bw_result, mpamid) - 0usize];
    ["Offset of field: dcmi_qos_bw_result::curr"]
        [::std::mem::offset_of!(dcmi_qos_bw_result, curr) - 4usize];
    ["Offset of field: dcmi_qos_bw_result::bw_max"]
        [::std::mem::offset_of!(dcmi_qos_bw_result, bw_max) - 8usize];
    ["Offset of field: dcmi_qos_bw_result::bw_min"]
        [::std::mem::offset_of!(dcmi_qos_bw_result, bw_min) - 12usize];
    ["Offset of field: dcmi_qos_bw_result::bw_mean"]
        [::std::mem::offset_of!(dcmi_qos_bw_result, bw_mean) - 16usize];
    ["Offset of field: dcmi_qos_bw_result::reserved"]
        [::std::mem::offset_of!(dcmi_qos_bw_result, reserved) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_qos_mata_config {
    pub mpamid: ::std::os::raw::c_int,
    pub bw_high: ::std::os::raw::c_uint,
    pub bw_low: ::std::os::raw::c_uint,
    pub hardlimit: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_qos_mata_config"][::std::mem::size_of::<dcmi_qos_mata_config>() - 48usize];
    ["Alignment of dcmi_qos_mata_config"][::std::mem::align_of::<dcmi_qos_mata_config>() - 4usize];
    ["Offset of field: dcmi_qos_mata_config::mpamid"]
        [::std::mem::offset_of!(dcmi_qos_mata_config, mpamid) - 0usize];
    ["Offset of field: dcmi_qos_mata_config::bw_high"]
        [::std::mem::offset_of!(dcmi_qos_mata_config, bw_high) - 4usize];
    ["Offset of field: dcmi_qos_mata_config::bw_low"]
        [::std::mem::offset_of!(dcmi_qos_mata_config, bw_low) - 8usize];
    ["Offset of field: dcmi_qos_mata_config::hardlimit"]
        [::std::mem::offset_of!(dcmi_qos_mata_config, hardlimit) - 12usize];
    ["Offset of field: dcmi_qos_mata_config::reserved"]
        [::std::mem::offset_of!(dcmi_qos_mata_config, reserved) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_qos_master_config {
    pub master: ::std::os::raw::c_int,
    pub mpamid: ::std::os::raw::c_int,
    pub qos: ::std::os::raw::c_int,
    pub pmg: ::std::os::raw::c_int,
    pub bitmap: [::std::os::raw::c_ulonglong; 4usize],
    pub reserved: [::std::os::raw::c_int; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_qos_master_config"][::std::mem::size_of::<dcmi_qos_master_config>() - 80usize];
    ["Alignment of dcmi_qos_master_config"]
        [::std::mem::align_of::<dcmi_qos_master_config>() - 8usize];
    ["Offset of field: dcmi_qos_master_config::master"]
        [::std::mem::offset_of!(dcmi_qos_master_config, master) - 0usize];
    ["Offset of field: dcmi_qos_master_config::mpamid"]
        [::std::mem::offset_of!(dcmi_qos_master_config, mpamid) - 4usize];
    ["Offset of field: dcmi_qos_master_config::qos"]
        [::std::mem::offset_of!(dcmi_qos_master_config, qos) - 8usize];
    ["Offset of field: dcmi_qos_master_config::pmg"]
        [::std::mem::offset_of!(dcmi_qos_master_config, pmg) - 12usize];
    ["Offset of field: dcmi_qos_master_config::bitmap"]
        [::std::mem::offset_of!(dcmi_qos_master_config, bitmap) - 16usize];
    ["Offset of field: dcmi_qos_master_config::reserved"]
        [::std::mem::offset_of!(dcmi_qos_master_config, reserved) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_qos_gbl_config {
    pub enable: ::std::os::raw::c_uint,
    pub autoqos_fuse_en: ::std::os::raw::c_uint,
    pub mpamqos_fuse_mode: ::std::os::raw::c_uint,
    pub mpam_subtype: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_int; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_qos_gbl_config"][::std::mem::size_of::<dcmi_qos_gbl_config>() - 48usize];
    ["Alignment of dcmi_qos_gbl_config"][::std::mem::align_of::<dcmi_qos_gbl_config>() - 4usize];
    ["Offset of field: dcmi_qos_gbl_config::enable"]
        [::std::mem::offset_of!(dcmi_qos_gbl_config, enable) - 0usize];
    ["Offset of field: dcmi_qos_gbl_config::autoqos_fuse_en"]
        [::std::mem::offset_of!(dcmi_qos_gbl_config, autoqos_fuse_en) - 4usize];
    ["Offset of field: dcmi_qos_gbl_config::mpamqos_fuse_mode"]
        [::std::mem::offset_of!(dcmi_qos_gbl_config, mpamqos_fuse_mode) - 8usize];
    ["Offset of field: dcmi_qos_gbl_config::mpam_subtype"]
        [::std::mem::offset_of!(dcmi_qos_gbl_config, mpam_subtype) - 12usize];
    ["Offset of field: dcmi_qos_gbl_config::reserved"]
        [::std::mem::offset_of!(dcmi_qos_gbl_config, reserved) - 16usize];
};
pub const DCMI_CHIP_INFO_SUB_CMD_DCMI_CHIP_INF_SUB_CMD_CHIP_ID: DCMI_CHIP_INFO_SUB_CMD = 0;
pub const DCMI_CHIP_INFO_SUB_CMD_DCMI_CHIP_INF_SUB_CMD_SPOD_INFO: DCMI_CHIP_INFO_SUB_CMD = 1;
pub const DCMI_CHIP_INFO_SUB_CMD_DCMI_CHIP_INF_SUB_CMD_MAX: DCMI_CHIP_INFO_SUB_CMD = 255;
pub type DCMI_CHIP_INFO_SUB_CMD = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_spod_info {
    pub sdid: ::std::os::raw::c_uint,
    pub super_pod_size: ::std::os::raw::c_uint,
    pub super_pod_id: ::std::os::raw::c_uint,
    pub server_index: ::std::os::raw::c_uint,
    pub reserve: [::std::os::raw::c_uint; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_spod_info"][::std::mem::size_of::<dcmi_spod_info>() - 48usize];
    ["Alignment of dcmi_spod_info"][::std::mem::align_of::<dcmi_spod_info>() - 4usize];
    ["Offset of field: dcmi_spod_info::sdid"]
        [::std::mem::offset_of!(dcmi_spod_info, sdid) - 0usize];
    ["Offset of field: dcmi_spod_info::super_pod_size"]
        [::std::mem::offset_of!(dcmi_spod_info, super_pod_size) - 4usize];
    ["Offset of field: dcmi_spod_info::super_pod_id"]
        [::std::mem::offset_of!(dcmi_spod_info, super_pod_id) - 8usize];
    ["Offset of field: dcmi_spod_info::server_index"]
        [::std::mem::offset_of!(dcmi_spod_info, server_index) - 12usize];
    ["Offset of field: dcmi_spod_info::reserve"]
        [::std::mem::offset_of!(dcmi_spod_info, reserve) - 16usize];
};
pub const DCMI_TS_SUB_CMD_DCMI_TS_SUB_CMD_AICORE_UTILIZATION_RATE: DCMI_TS_SUB_CMD = 0;
pub const DCMI_TS_SUB_CMD_DCMI_TS_SUB_CMD_VECTORCORE_UTILIZATION_RATE: DCMI_TS_SUB_CMD = 1;
pub const DCMI_TS_SUB_CMD_DCMI_TS_SUB_CMD_FFTS_TYPE: DCMI_TS_SUB_CMD = 2;
pub const DCMI_TS_SUB_CMD_DCMI_TS_SUB_CMD_SET_FAULT_MASK: DCMI_TS_SUB_CMD = 3;
pub const DCMI_TS_SUB_CMD_DCMI_TS_SUB_CMD_GET_FAULT_MASK: DCMI_TS_SUB_CMD = 4;
pub const DCMI_TS_SUB_CMD_DCMI_TS_SUB_CMD_MAX: DCMI_TS_SUB_CMD = 5;
pub type DCMI_TS_SUB_CMD = ::std::os::raw::c_uint;
pub const DCMI_RECOVERY_SUB_CMD_DCMI_RCVR_SUB_CMD_SET_FLAG: DCMI_RECOVERY_SUB_CMD = 0;
pub const DCMI_RECOVERY_SUB_CMD_DCMI_RCVR_SUB_CMD_GET_FLAG: DCMI_RECOVERY_SUB_CMD = 1;
pub const DCMI_RECOVERY_SUB_CMD_DCMI_RCVR_SUB_CMD_CLEAN_FLAG: DCMI_RECOVERY_SUB_CMD = 2;
pub const DCMI_RECOVERY_SUB_CMD_DCMI_RCVR_SUB_CMD_RESET_BOOT_CNT: DCMI_RECOVERY_SUB_CMD = 3;
pub const DCMI_RECOVERY_SUB_CMD_DCMI_RCVR_SUB_CMD_SET_STATUS: DCMI_RECOVERY_SUB_CMD = 4;
pub type DCMI_RECOVERY_SUB_CMD = ::std::os::raw::c_uint;
pub const DCMI_SUB_OS_TYPE_DCMI_SUB_OS_SD: DCMI_SUB_OS_TYPE = 0;
pub const DCMI_SUB_OS_TYPE_DCMI_SUB_OS_ALL: DCMI_SUB_OS_TYPE = 254;
pub const DCMI_SUB_OS_TYPE_DCMI_SUB_OS_INVALID: DCMI_SUB_OS_TYPE = 255;
pub type DCMI_SUB_OS_TYPE = ::std::os::raw::c_uint;
pub const DCMI_UFS_SUB_CMD_DCMI_UFS_SUB_CMD_CONFIG: DCMI_UFS_SUB_CMD = 0;
pub const DCMI_UFS_SUB_CMD_DCMI_UFS_SUB_CMD_STATUS: DCMI_UFS_SUB_CMD = 1;
pub const DCMI_UFS_SUB_CMD_DCMI_UFS_SUB_CMD_INLINE_CRYPTO: DCMI_UFS_SUB_CMD = 2;
pub const DCMI_UFS_SUB_CMD_DCMI_UFS_SUB_CMD_CREATE_KEY: DCMI_UFS_SUB_CMD = 3;
pub const DCMI_UFS_SUB_CMD_DCMI_UFS_SUB_CMD_DELETE_KEY: DCMI_UFS_SUB_CMD = 4;
pub const DCMI_UFS_SUB_CMD_DCMI_UFS_SUB_CMD_QUERY_DESCRIPTOR: DCMI_UFS_SUB_CMD = 5;
pub const DCMI_UFS_SUB_CMD_DCMI_UFS_SUB_CMD_INVALID: DCMI_UFS_SUB_CMD = 255;
pub type DCMI_UFS_SUB_CMD = ::std::os::raw::c_uint;
pub const DCMI_UFS_PWR_MODE_DCMI_UFS_FAST_MODE: DCMI_UFS_PWR_MODE = 1;
pub const DCMI_UFS_PWR_MODE_DCMI_UFS_SLOW_MODE: DCMI_UFS_PWR_MODE = 2;
pub const DCMI_UFS_PWR_MODE_DCMI_UFS_FASTAUTO_MODE: DCMI_UFS_PWR_MODE = 4;
pub const DCMI_UFS_PWR_MODE_DCMI_UFS_SLOWAUTO_MODE: DCMI_UFS_PWR_MODE = 5;
pub const DCMI_UFS_PWR_MODE_DCMI_UFS_UNCHANGED: DCMI_UFS_PWR_MODE = 7;
pub type DCMI_UFS_PWR_MODE = ::std::os::raw::c_uint;
pub const DCMI_UFS_GEAR_DCMI_UFS_DONT_CHANGE: DCMI_UFS_GEAR = 0;
pub const DCMI_UFS_GEAR_DCMI_UFS_GEAR_1: DCMI_UFS_GEAR = 1;
pub const DCMI_UFS_GEAR_DCMI_UFS_GEAR_2: DCMI_UFS_GEAR = 2;
pub const DCMI_UFS_GEAR_DCMI_UFS_GEAR_3: DCMI_UFS_GEAR = 3;
pub type DCMI_UFS_GEAR = ::std::os::raw::c_uint;
pub const DCMI_UFS_HS_MODE_DCMI_UFS_PA_HS_MODE_A: DCMI_UFS_HS_MODE = 1;
pub const DCMI_UFS_HS_MODE_DCMI_UFS_PA_HS_MODE_B: DCMI_UFS_HS_MODE = 2;
pub type DCMI_UFS_HS_MODE = ::std::os::raw::c_uint;
#[doc = "< UFS_ACTIVE_PWR_MODE, UIC_LINK_ACTIVE_STATE"]
pub const DCMI_UFS_PM_LEVEL_DCMI_UFS_PM_LEVEL_0: DCMI_UFS_PM_LEVEL = 0;
#[doc = "< UFS_ACTIVE_PWR_MODE, UIC_LINK_HIBERN8_STATE"]
pub const DCMI_UFS_PM_LEVEL_DCMI_UFS_PM_LEVEL_1: DCMI_UFS_PM_LEVEL = 1;
#[doc = "< UFS_SLEEP_PWR_MODE, UIC_LINK_ACTIVE_STATE"]
pub const DCMI_UFS_PM_LEVEL_DCMI_UFS_PM_LEVEL_2: DCMI_UFS_PM_LEVEL = 2;
#[doc = "< UFS_SLEEP_PWR_MODE, UIC_LINK_HIBERN8_STATE"]
pub const DCMI_UFS_PM_LEVEL_DCMI_UFS_PM_LEVEL_3: DCMI_UFS_PM_LEVEL = 3;
#[doc = "< UFS_POWERDOWN_PWR_MODE, UIC_LINK_HIBERN8_STATE"]
pub const DCMI_UFS_PM_LEVEL_DCMI_UFS_PM_LEVEL_4: DCMI_UFS_PM_LEVEL = 4;
#[doc = "< UFS_POWERDOWN_PWR_MODE, UIC_LINK_OFF_STATE"]
pub const DCMI_UFS_PM_LEVEL_DCMI_UFS_PM_LEVEL_5: DCMI_UFS_PM_LEVEL = 5;
pub const DCMI_UFS_PM_LEVEL_DCMI_UFS_PM_LEVEL_MAX: DCMI_UFS_PM_LEVEL = 6;
pub type DCMI_UFS_PM_LEVEL = ::std::os::raw::c_uint;
pub const DCMI_UFS_DEV_CLOCK_DCMI_UFS_DEV_CLK_19M2: DCMI_UFS_DEV_CLOCK = 0;
pub const DCMI_UFS_DEV_CLOCK_DCMI_UFS_DEV_CLK_26M0: DCMI_UFS_DEV_CLOCK = 1;
pub const DCMI_UFS_DEV_CLOCK_DCMI_UFS_DEV_CLK_38M4: DCMI_UFS_DEV_CLOCK = 2;
pub const DCMI_UFS_DEV_CLOCK_DCMI_UFS_DEV_CLK_52M0: DCMI_UFS_DEV_CLOCK = 3;
pub const DCMI_UFS_DEV_CLOCK_DCMI_UFS_DEV_CLK_INVAL: DCMI_UFS_DEV_CLOCK = 4;
pub type DCMI_UFS_DEV_CLOCK = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ufs_config_stru {
    #[doc = "< Link Rate Mode"]
    pub pwr_mode: DCMI_UFS_PWR_MODE,
    #[doc = "< Link Rate"]
    pub pwr_gear: DCMI_UFS_GEAR,
    #[doc = "< HS Series, Only query, not configuration"]
    pub hs_series: DCMI_UFS_HS_MODE,
    #[doc = "< HS Series, Only query, not configuration"]
    pub suspend_pwr_level: DCMI_UFS_PM_LEVEL,
    #[doc = "< enable autoH8: 0-disable, 1-enable"]
    pub auto_h8: ::std::os::raw::c_uint,
    #[doc = "< active lanes count"]
    pub lane_count: ::std::os::raw::c_uint,
    #[doc = "< Reference Clock Frequency value, Only query, not configuration"]
    pub device_refclk: DCMI_UFS_DEV_CLOCK,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ufs_config_stru"][::std::mem::size_of::<dcmi_ufs_config_stru>() - 28usize];
    ["Alignment of dcmi_ufs_config_stru"][::std::mem::align_of::<dcmi_ufs_config_stru>() - 4usize];
    ["Offset of field: dcmi_ufs_config_stru::pwr_mode"]
        [::std::mem::offset_of!(dcmi_ufs_config_stru, pwr_mode) - 0usize];
    ["Offset of field: dcmi_ufs_config_stru::pwr_gear"]
        [::std::mem::offset_of!(dcmi_ufs_config_stru, pwr_gear) - 4usize];
    ["Offset of field: dcmi_ufs_config_stru::hs_series"]
        [::std::mem::offset_of!(dcmi_ufs_config_stru, hs_series) - 8usize];
    ["Offset of field: dcmi_ufs_config_stru::suspend_pwr_level"]
        [::std::mem::offset_of!(dcmi_ufs_config_stru, suspend_pwr_level) - 12usize];
    ["Offset of field: dcmi_ufs_config_stru::auto_h8"]
        [::std::mem::offset_of!(dcmi_ufs_config_stru, auto_h8) - 16usize];
    ["Offset of field: dcmi_ufs_config_stru::lane_count"]
        [::std::mem::offset_of!(dcmi_ufs_config_stru, lane_count) - 20usize];
    ["Offset of field: dcmi_ufs_config_stru::device_refclk"]
        [::std::mem::offset_of!(dcmi_ufs_config_stru, device_refclk) - 24usize];
};
pub type DCMI_UFS_CONFIG_STRU = dcmi_ufs_config_stru;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ufs_partition_stru {
    pub lun: ::std::os::raw::c_uint,
    pub lba_start: ::std::os::raw::c_uint,
    pub lba_end: ::std::os::raw::c_uint,
    pub crypto_key_index: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ufs_partition_stru"][::std::mem::size_of::<dcmi_ufs_partition_stru>() - 32usize];
    ["Alignment of dcmi_ufs_partition_stru"]
        [::std::mem::align_of::<dcmi_ufs_partition_stru>() - 4usize];
    ["Offset of field: dcmi_ufs_partition_stru::lun"]
        [::std::mem::offset_of!(dcmi_ufs_partition_stru, lun) - 0usize];
    ["Offset of field: dcmi_ufs_partition_stru::lba_start"]
        [::std::mem::offset_of!(dcmi_ufs_partition_stru, lba_start) - 4usize];
    ["Offset of field: dcmi_ufs_partition_stru::lba_end"]
        [::std::mem::offset_of!(dcmi_ufs_partition_stru, lba_end) - 8usize];
    ["Offset of field: dcmi_ufs_partition_stru::crypto_key_index"]
        [::std::mem::offset_of!(dcmi_ufs_partition_stru, crypto_key_index) - 12usize];
    ["Offset of field: dcmi_ufs_partition_stru::reserved"]
        [::std::mem::offset_of!(dcmi_ufs_partition_stru, reserved) - 16usize];
};
pub type DCMI_UFS_PARTITION_STRU = dcmi_ufs_partition_stru;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ufs_inline_crypto_stru {
    pub enable: ::std::os::raw::c_uint,
    pub partition: [DCMI_UFS_PARTITION_STRU; 8usize],
    pub partition_cnt: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ufs_inline_crypto_stru"]
        [::std::mem::size_of::<dcmi_ufs_inline_crypto_stru>() - 264usize];
    ["Alignment of dcmi_ufs_inline_crypto_stru"]
        [::std::mem::align_of::<dcmi_ufs_inline_crypto_stru>() - 4usize];
    ["Offset of field: dcmi_ufs_inline_crypto_stru::enable"]
        [::std::mem::offset_of!(dcmi_ufs_inline_crypto_stru, enable) - 0usize];
    ["Offset of field: dcmi_ufs_inline_crypto_stru::partition"]
        [::std::mem::offset_of!(dcmi_ufs_inline_crypto_stru, partition) - 4usize];
    ["Offset of field: dcmi_ufs_inline_crypto_stru::partition_cnt"]
        [::std::mem::offset_of!(dcmi_ufs_inline_crypto_stru, partition_cnt) - 260usize];
};
pub type DCMI_UFS_INLINE_CRYPTO_STRU = dcmi_ufs_inline_crypto_stru;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ufs_key_index_stru {
    pub key_index: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uint; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ufs_key_index_stru"][::std::mem::size_of::<dcmi_ufs_key_index_stru>() - 20usize];
    ["Alignment of dcmi_ufs_key_index_stru"]
        [::std::mem::align_of::<dcmi_ufs_key_index_stru>() - 4usize];
    ["Offset of field: dcmi_ufs_key_index_stru::key_index"]
        [::std::mem::offset_of!(dcmi_ufs_key_index_stru, key_index) - 0usize];
    ["Offset of field: dcmi_ufs_key_index_stru::reserved"]
        [::std::mem::offset_of!(dcmi_ufs_key_index_stru, reserved) - 4usize];
};
pub type DCMI_UFS_KEY_INDEX_STRU = dcmi_ufs_key_index_stru;
pub const DCMI_UFS_STATE_DCMI_UFS_STATE_LINKOFF: DCMI_UFS_STATE = 0;
pub const DCMI_UFS_STATE_DCMI_UFS_STATE_ACTIVE: DCMI_UFS_STATE = 1;
pub const DCMI_UFS_STATE_DCMI_UFS_STATE_HIBERN8: DCMI_UFS_STATE = 2;
pub type DCMI_UFS_STATE = ::std::os::raw::c_uint;
#[doc = "< Link powered down or disabled"]
pub const DCMI_UFS_LINK_STATE_DCMI_UFS_UIC_LINK_OFF_STATE: DCMI_UFS_LINK_STATE = 0;
#[doc = "< Link is in Fast/Slow/Sleep state"]
pub const DCMI_UFS_LINK_STATE_DCMI_UFS_UIC_LINK_ACTIVE_STATE: DCMI_UFS_LINK_STATE = 1;
#[doc = "< Link is in Hibernate state"]
pub const DCMI_UFS_LINK_STATE_DCMI_UFS_UIC_LINK_HIBERN8_STATE: DCMI_UFS_LINK_STATE = 2;
pub type DCMI_UFS_LINK_STATE = ::std::os::raw::c_uint;
pub const DCMI_UFS_DEV_PWR_STATE_DCMI_UFS_DEV_PWR_ACTIVE: DCMI_UFS_DEV_PWR_STATE = 1;
pub const DCMI_UFS_DEV_PWR_STATE_DCMI_UFS_DEV_PWR_SLEEP: DCMI_UFS_DEV_PWR_STATE = 2;
pub const DCMI_UFS_DEV_PWR_STATE_DCMI_UFS_DEV_PWR_POWERDOWN: DCMI_UFS_DEV_PWR_STATE = 3;
pub type DCMI_UFS_DEV_PWR_STATE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ufs_descriptor_stru {
    pub automotive_health: [::std::os::raw::c_uchar; 255usize],
    pub device_health: [::std::os::raw::c_uchar; 255usize],
    pub device: [::std::os::raw::c_uchar; 255usize],
    pub osv_report: [::std::os::raw::c_uchar; 255usize],
    pub nand_info_report: [::std::os::raw::c_uchar; 255usize],
    pub reserved: [::std::os::raw::c_uchar; 255usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ufs_descriptor_stru"]
        [::std::mem::size_of::<dcmi_ufs_descriptor_stru>() - 1530usize];
    ["Alignment of dcmi_ufs_descriptor_stru"]
        [::std::mem::align_of::<dcmi_ufs_descriptor_stru>() - 1usize];
    ["Offset of field: dcmi_ufs_descriptor_stru::automotive_health"]
        [::std::mem::offset_of!(dcmi_ufs_descriptor_stru, automotive_health) - 0usize];
    ["Offset of field: dcmi_ufs_descriptor_stru::device_health"]
        [::std::mem::offset_of!(dcmi_ufs_descriptor_stru, device_health) - 255usize];
    ["Offset of field: dcmi_ufs_descriptor_stru::device"]
        [::std::mem::offset_of!(dcmi_ufs_descriptor_stru, device) - 510usize];
    ["Offset of field: dcmi_ufs_descriptor_stru::osv_report"]
        [::std::mem::offset_of!(dcmi_ufs_descriptor_stru, osv_report) - 765usize];
    ["Offset of field: dcmi_ufs_descriptor_stru::nand_info_report"]
        [::std::mem::offset_of!(dcmi_ufs_descriptor_stru, nand_info_report) - 1020usize];
    ["Offset of field: dcmi_ufs_descriptor_stru::reserved"]
        [::std::mem::offset_of!(dcmi_ufs_descriptor_stru, reserved) - 1275usize];
};
pub type DCMI_UFS_DESCRIPTOR_STRU = dcmi_ufs_descriptor_stru;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ufs_status_stru {
    #[doc = "< ufs status"]
    pub status: DCMI_UFS_STATE,
    #[doc = "< rx rate mode"]
    pub rx_pwr_mode: DCMI_UFS_PWR_MODE,
    #[doc = "< tx rate mode"]
    pub tx_pwr_mode: DCMI_UFS_PWR_MODE,
    #[doc = "< rx rate"]
    pub rx_pwr_gear: DCMI_UFS_GEAR,
    #[doc = "< tx rate"]
    pub tx_pwr_gear: DCMI_UFS_GEAR,
    #[doc = "< rx lanes"]
    pub rx_lanes: ::std::os::raw::c_uint,
    #[doc = "< tx lanes"]
    pub tx_lanes: ::std::os::raw::c_uint,
    #[doc = "< link power status"]
    pub link_pwr_status: DCMI_UFS_LINK_STATE,
    #[doc = "< device power status"]
    pub device_pwr_status: DCMI_UFS_DEV_PWR_STATE,
    #[doc = "< ufs device temperature"]
    pub temperature: ::std::os::raw::c_int,
    #[doc = "< ufs device exception status"]
    pub fault_status: ::std::os::raw::c_uint,
    #[doc = "< total raw device capacity"]
    pub total_capacity: ::std::os::raw::c_uint,
    #[doc = "< ufs device sub class"]
    pub model_number: ::std::os::raw::c_uint,
    #[doc = "< ufs device life time used"]
    pub device_life_time: ::std::os::raw::c_uint,
    #[doc = "< product revision level"]
    pub fw_ver: ::std::os::raw::c_uint,
    #[doc = "< whether to support firmware update: 0-not support, 1-support"]
    pub fw_update_enable: ::std::os::raw::c_uint,
    #[doc = "< ufs device product identification"]
    pub product_name: [::std::os::raw::c_uchar; 34usize],
    pub manufacturer_name: [::std::os::raw::c_uchar; 18usize],
    #[doc = " <ufs device manufacturer name"]
    pub serial_number: [::std::os::raw::c_uchar; 254usize],
    #[doc = "< ufs device specification version"]
    pub spec_version: ::std::os::raw::c_uint,
    #[doc = "< ufs device device version"]
    pub device_version: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ufs_status_stru"][::std::mem::size_of::<dcmi_ufs_status_stru>() - 380usize];
    ["Alignment of dcmi_ufs_status_stru"][::std::mem::align_of::<dcmi_ufs_status_stru>() - 4usize];
    ["Offset of field: dcmi_ufs_status_stru::status"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, status) - 0usize];
    ["Offset of field: dcmi_ufs_status_stru::rx_pwr_mode"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, rx_pwr_mode) - 4usize];
    ["Offset of field: dcmi_ufs_status_stru::tx_pwr_mode"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, tx_pwr_mode) - 8usize];
    ["Offset of field: dcmi_ufs_status_stru::rx_pwr_gear"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, rx_pwr_gear) - 12usize];
    ["Offset of field: dcmi_ufs_status_stru::tx_pwr_gear"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, tx_pwr_gear) - 16usize];
    ["Offset of field: dcmi_ufs_status_stru::rx_lanes"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, rx_lanes) - 20usize];
    ["Offset of field: dcmi_ufs_status_stru::tx_lanes"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, tx_lanes) - 24usize];
    ["Offset of field: dcmi_ufs_status_stru::link_pwr_status"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, link_pwr_status) - 28usize];
    ["Offset of field: dcmi_ufs_status_stru::device_pwr_status"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, device_pwr_status) - 32usize];
    ["Offset of field: dcmi_ufs_status_stru::temperature"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, temperature) - 36usize];
    ["Offset of field: dcmi_ufs_status_stru::fault_status"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, fault_status) - 40usize];
    ["Offset of field: dcmi_ufs_status_stru::total_capacity"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, total_capacity) - 44usize];
    ["Offset of field: dcmi_ufs_status_stru::model_number"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, model_number) - 48usize];
    ["Offset of field: dcmi_ufs_status_stru::device_life_time"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, device_life_time) - 52usize];
    ["Offset of field: dcmi_ufs_status_stru::fw_ver"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, fw_ver) - 56usize];
    ["Offset of field: dcmi_ufs_status_stru::fw_update_enable"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, fw_update_enable) - 60usize];
    ["Offset of field: dcmi_ufs_status_stru::product_name"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, product_name) - 64usize];
    ["Offset of field: dcmi_ufs_status_stru::manufacturer_name"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, manufacturer_name) - 98usize];
    ["Offset of field: dcmi_ufs_status_stru::serial_number"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, serial_number) - 116usize];
    ["Offset of field: dcmi_ufs_status_stru::spec_version"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, spec_version) - 372usize];
    ["Offset of field: dcmi_ufs_status_stru::device_version"]
        [::std::mem::offset_of!(dcmi_ufs_status_stru, device_version) - 376usize];
};
pub type DCMI_UFS_STATUS_STRU = dcmi_ufs_status_stru;
pub const DCMI_VDEV_MNG_SUB_CMD_DCMI_VMNG_SUB_CMD_GET_VDEV_RESOURCE: DCMI_VDEV_MNG_SUB_CMD = 0;
pub const DCMI_VDEV_MNG_SUB_CMD_DCMI_VMNG_SUB_CMD_GET_TOTAL_RESOURCE: DCMI_VDEV_MNG_SUB_CMD = 1;
pub const DCMI_VDEV_MNG_SUB_CMD_DCMI_VMNG_SUB_CMD_GET_FREE_RESOURCE: DCMI_VDEV_MNG_SUB_CMD = 2;
pub const DCMI_VDEV_MNG_SUB_CMD_DCMI_VMNG_SUB_CMD_SET_SRIOV_SWITCH: DCMI_VDEV_MNG_SUB_CMD = 3;
pub const DCMI_VDEV_MNG_SUB_CMD_DCMI_VMNG_SUB_CMD_GET_VDEV_ACTIVITY: DCMI_VDEV_MNG_SUB_CMD = 5;
pub const DCMI_VDEV_MNG_SUB_CMD_DCMI_VMNG_SUB_CMD_MAX: DCMI_VDEV_MNG_SUB_CMD = 6;
pub type DCMI_VDEV_MNG_SUB_CMD = ::std::os::raw::c_uint;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_AICORE_VOLTAGE_CURRENT: DCMI_LP_SUB_CMD = 0;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_HYBIRD_VOLTAGE_CURRENT: DCMI_LP_SUB_CMD = 1;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_TAISHAN_VOLTAGE_CURRENT: DCMI_LP_SUB_CMD = 2;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_DDR_VOLTAGE_CURRENT: DCMI_LP_SUB_CMD = 3;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_ACG: DCMI_LP_SUB_CMD = 4;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_STATUS: DCMI_LP_SUB_CMD = 5;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_TOPS_DETAILS: DCMI_LP_SUB_CMD = 6;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_SET_WORK_TOPS: DCMI_LP_SUB_CMD = 7;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_GET_WORK_TOPS: DCMI_LP_SUB_CMD = 8;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_AICORE_FREQREDUC_CAUSE: DCMI_LP_SUB_CMD = 9;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_GET_POWER_INFO: DCMI_LP_SUB_CMD = 10;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_SET_IDLE_SWITCH: DCMI_LP_SUB_CMD = 11;
pub const DCMI_LP_SUB_CMD_DCMI_LP_SUB_CMD_MAX: DCMI_LP_SUB_CMD = 12;
pub type DCMI_LP_SUB_CMD = ::std::os::raw::c_uint;
pub const DCMI_EX_CERT_SUB_CMD_DCMI_CERT_SUB_CMD_INIT_TLS_PUB_KEY: DCMI_EX_CERT_SUB_CMD = 0;
pub const DCMI_EX_CERT_SUB_CMD_DCMI_CERT_SUB_CMD_INIT_RESERVE: DCMI_EX_CERT_SUB_CMD = 1;
pub const DCMI_EX_CERT_SUB_CMD_DCMI_CERT_SUB_CMD_TLS_CERT_INFO: DCMI_EX_CERT_SUB_CMD = 2;
pub const DCMI_EX_CERT_SUB_CMD_DCMI_CERT_SUB_CMD_MAX: DCMI_EX_CERT_SUB_CMD = 3;
pub type DCMI_EX_CERT_SUB_CMD = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_lp_cur_tops_stru {
    pub work_tops: ::std::os::raw::c_uint,
    pub tops_nums: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_lp_cur_tops_stru"][::std::mem::size_of::<dcmi_lp_cur_tops_stru>() - 8usize];
    ["Alignment of dcmi_lp_cur_tops_stru"]
        [::std::mem::align_of::<dcmi_lp_cur_tops_stru>() - 4usize];
    ["Offset of field: dcmi_lp_cur_tops_stru::work_tops"]
        [::std::mem::offset_of!(dcmi_lp_cur_tops_stru, work_tops) - 0usize];
    ["Offset of field: dcmi_lp_cur_tops_stru::tops_nums"]
        [::std::mem::offset_of!(dcmi_lp_cur_tops_stru, tops_nums) - 4usize];
};
pub type DCMI_LP_CUR_TOPS_STRU = dcmi_lp_cur_tops_stru;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_lp_work_tops_stru {
    pub work_tops: ::std::os::raw::c_uint,
    pub is_in_flash: ::std::os::raw::c_uint,
    pub reserve: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_lp_work_tops_stru"][::std::mem::size_of::<dcmi_lp_work_tops_stru>() - 40usize];
    ["Alignment of dcmi_lp_work_tops_stru"]
        [::std::mem::align_of::<dcmi_lp_work_tops_stru>() - 4usize];
    ["Offset of field: dcmi_lp_work_tops_stru::work_tops"]
        [::std::mem::offset_of!(dcmi_lp_work_tops_stru, work_tops) - 0usize];
    ["Offset of field: dcmi_lp_work_tops_stru::is_in_flash"]
        [::std::mem::offset_of!(dcmi_lp_work_tops_stru, is_in_flash) - 4usize];
    ["Offset of field: dcmi_lp_work_tops_stru::reserve"]
        [::std::mem::offset_of!(dcmi_lp_work_tops_stru, reserve) - 8usize];
};
pub type DCMI_LP_WORK_TOPS_STRU = dcmi_lp_work_tops_stru;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_lp_each_tops_details {
    pub work_tops: ::std::os::raw::c_uint,
    pub aic_tops: ::std::os::raw::c_uint,
    pub aic_freq: ::std::os::raw::c_uint,
    pub aic_vol: ::std::os::raw::c_uint,
    pub cpu_freq: ::std::os::raw::c_uint,
    pub cpu_vol: ::std::os::raw::c_uint,
    pub reserve: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_lp_each_tops_details"]
        [::std::mem::size_of::<dcmi_lp_each_tops_details>() - 56usize];
    ["Alignment of dcmi_lp_each_tops_details"]
        [::std::mem::align_of::<dcmi_lp_each_tops_details>() - 4usize];
    ["Offset of field: dcmi_lp_each_tops_details::work_tops"]
        [::std::mem::offset_of!(dcmi_lp_each_tops_details, work_tops) - 0usize];
    ["Offset of field: dcmi_lp_each_tops_details::aic_tops"]
        [::std::mem::offset_of!(dcmi_lp_each_tops_details, aic_tops) - 4usize];
    ["Offset of field: dcmi_lp_each_tops_details::aic_freq"]
        [::std::mem::offset_of!(dcmi_lp_each_tops_details, aic_freq) - 8usize];
    ["Offset of field: dcmi_lp_each_tops_details::aic_vol"]
        [::std::mem::offset_of!(dcmi_lp_each_tops_details, aic_vol) - 12usize];
    ["Offset of field: dcmi_lp_each_tops_details::cpu_freq"]
        [::std::mem::offset_of!(dcmi_lp_each_tops_details, cpu_freq) - 16usize];
    ["Offset of field: dcmi_lp_each_tops_details::cpu_vol"]
        [::std::mem::offset_of!(dcmi_lp_each_tops_details, cpu_vol) - 20usize];
    ["Offset of field: dcmi_lp_each_tops_details::reserve"]
        [::std::mem::offset_of!(dcmi_lp_each_tops_details, reserve) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_lp_tops_details_stru {
    pub tops_nums: ::std::os::raw::c_uint,
    pub each_work_tops: [dcmi_lp_each_tops_details; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_lp_tops_details_stru"]
        [::std::mem::size_of::<dcmi_lp_tops_details_stru>() - 564usize];
    ["Alignment of dcmi_lp_tops_details_stru"]
        [::std::mem::align_of::<dcmi_lp_tops_details_stru>() - 4usize];
    ["Offset of field: dcmi_lp_tops_details_stru::tops_nums"]
        [::std::mem::offset_of!(dcmi_lp_tops_details_stru, tops_nums) - 0usize];
    ["Offset of field: dcmi_lp_tops_details_stru::each_work_tops"]
        [::std::mem::offset_of!(dcmi_lp_tops_details_stru, each_work_tops) - 4usize];
};
pub type DCMI_LP_TOPS_DETAILS_STRU = dcmi_lp_tops_details_stru;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_lp_power_info {
    pub soc_rated_power: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_lp_power_info"][::std::mem::size_of::<dcmi_lp_power_info>() - 36usize];
    ["Alignment of dcmi_lp_power_info"][::std::mem::align_of::<dcmi_lp_power_info>() - 4usize];
    ["Offset of field: dcmi_lp_power_info::soc_rated_power"]
        [::std::mem::offset_of!(dcmi_lp_power_info, soc_rated_power) - 0usize];
    ["Offset of field: dcmi_lp_power_info::reserved"]
        [::std::mem::offset_of!(dcmi_lp_power_info, reserved) - 4usize];
};
pub type DCMI_LP_POWER_INFO_STRU = dcmi_lp_power_info;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_NVE: dcmi_component_type = 0;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_XLOADER: dcmi_component_type = 1;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_M3FW: dcmi_component_type = 2;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_UEFI: dcmi_component_type = 3;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_TEE: dcmi_component_type = 4;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_KERNEL: dcmi_component_type = 5;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_DTB: dcmi_component_type = 6;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_ROOTFS: dcmi_component_type = 7;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_IMU: dcmi_component_type = 8;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_IMP: dcmi_component_type = 9;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_AICPU: dcmi_component_type = 10;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_HBOOT1_A: dcmi_component_type = 11;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_HBOOT1_B: dcmi_component_type = 12;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_HBOOT2: dcmi_component_type = 13;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_DDR: dcmi_component_type = 14;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_LP: dcmi_component_type = 15;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_HSM: dcmi_component_type = 16;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_SAFETY_ISLAND: dcmi_component_type = 17;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_HILINK: dcmi_component_type = 18;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_RAWDATA: dcmi_component_type = 19;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_SYSDRV: dcmi_component_type = 20;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_ADSAPP: dcmi_component_type = 21;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_COMISOLATOR: dcmi_component_type = 22;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_CLUSTER: dcmi_component_type = 23;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_CUSTOMIZED: dcmi_component_type = 24;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_SYS_BASE_CONFIG: dcmi_component_type = 25;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_RECOVERY: dcmi_component_type = 26;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_HILINK2: dcmi_component_type = 27;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_LOGIC_BIST: dcmi_component_type = 28;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_MEMORY_BIST: dcmi_component_type = 29;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_ATF: dcmi_component_type = 30;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_USER_BASE_CONFIG: dcmi_component_type = 31;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_BOOTROM: dcmi_component_type = 32;
pub const dcmi_component_type_DCMI_COMPONENT_TYPE_MAX: dcmi_component_type = 33;
pub const dcmi_component_type_DCMI_UPGRADE_AND_RESET_ALL_COMPONENT: dcmi_component_type =
    4294967287;
pub const dcmi_component_type_DCMI_UPGRADE_ALL_IMAGE_COMPONENT: dcmi_component_type = 4294967293;
pub const dcmi_component_type_DCMI_UPGRADE_ALL_FIRMWARE_COMPONENT: dcmi_component_type = 4294967294;
pub const dcmi_component_type_DCMI_UPGRADE_ALL_COMPONENT: dcmi_component_type = 4294967295;
pub type dcmi_component_type = ::std::os::raw::c_uint;
pub const dcmi_upgrade_state_DCMI_UPGRADE_IDLE: dcmi_upgrade_state = 0;
pub const dcmi_upgrade_state_DCMI_UPGRADE_UPGRADING: dcmi_upgrade_state = 1;
pub const dcmi_upgrade_state_DCMI_UPGRADE_NOT_SUPPORT: dcmi_upgrade_state = 2;
pub const dcmi_upgrade_state_DCMI_UPGRADE_UPGRADE_FAIL: dcmi_upgrade_state = 3;
pub const dcmi_upgrade_state_DCMI_UPGRADE_NOT_NEED: dcmi_upgrade_state = 4;
pub const dcmi_upgrade_state_DCMI_UPGRADE_NEED_VALIDATE: dcmi_upgrade_state = 5;
pub const dcmi_upgrade_state_DCMI_UPGRADE_STATE_NONE: dcmi_upgrade_state = 6;
pub type dcmi_upgrade_state = ::std::os::raw::c_uint;
pub const dcmi_upgrade_type_MCU_UPGRADE_START: dcmi_upgrade_type = 1;
pub const dcmi_upgrade_type_MCU_UPGRADE_VALIDETE: dcmi_upgrade_type = 3;
pub const dcmi_upgrade_type_VRD_UPGRADE_START: dcmi_upgrade_type = 11;
pub const dcmi_upgrade_type_MCU_UPGRADE_NONE: dcmi_upgrade_type = 12;
pub type dcmi_upgrade_type = ::std::os::raw::c_uint;
pub const dcmi_boot_status_DCMI_BOOT_STATUS_UNINIT: dcmi_boot_status = 0;
pub const dcmi_boot_status_DCMI_BOOT_STATUS_BIOS: dcmi_boot_status = 1;
pub const dcmi_boot_status_DCMI_BOOT_STATUS_OS: dcmi_boot_status = 2;
pub const dcmi_boot_status_DCMI_BOOT_STATUS_FINISH: dcmi_boot_status = 3;
pub const dcmi_boot_status_DCMI_SYSTEM_START_FINISH: dcmi_boot_status = 16;
pub type dcmi_boot_status = ::std::os::raw::c_uint;
pub const dcmi_device_type_DCMI_DEVICE_TYPE_DDR: dcmi_device_type = 0;
pub const dcmi_device_type_DCMI_DEVICE_TYPE_SRAM: dcmi_device_type = 1;
pub const dcmi_device_type_DCMI_DEVICE_TYPE_HBM: dcmi_device_type = 2;
pub const dcmi_device_type_DCMI_DEVICE_TYPE_NPU: dcmi_device_type = 3;
pub const dcmi_device_type_DCMI_HBM_RECORDED_SINGLE_ADDR: dcmi_device_type = 4;
pub const dcmi_device_type_DCMI_HBM_RECORDED_MULTI_ADDR: dcmi_device_type = 5;
pub const dcmi_device_type_DCMI_DEVICE_TYPE_NONE: dcmi_device_type = 255;
pub type dcmi_device_type = ::std::os::raw::c_uint;
pub const dcmi_freq_type_DCMI_FREQ_DDR: dcmi_freq_type = 1;
pub const dcmi_freq_type_DCMI_FREQ_CTRLCPU: dcmi_freq_type = 2;
pub const dcmi_freq_type_DCMI_FREQ_HBM: dcmi_freq_type = 6;
pub const dcmi_freq_type_DCMI_FREQ_AICORE_CURRENT_: dcmi_freq_type = 7;
pub const dcmi_freq_type_DCMI_FREQ_AICORE_MAX: dcmi_freq_type = 9;
pub const dcmi_freq_type_DCMI_FREQ_VECTORCORE_CURRENT: dcmi_freq_type = 12;
pub type dcmi_freq_type = ::std::os::raw::c_uint;
pub const dcmi_manager_sensor_id_DCMI_CLUSTER_TEMP_ID: dcmi_manager_sensor_id = 0;
pub const dcmi_manager_sensor_id_DCMI_PERI_TEMP_ID: dcmi_manager_sensor_id = 1;
pub const dcmi_manager_sensor_id_DCMI_AICORE0_TEMP_ID: dcmi_manager_sensor_id = 2;
pub const dcmi_manager_sensor_id_DCMI_AICORE1_TEMP_ID: dcmi_manager_sensor_id = 3;
pub const dcmi_manager_sensor_id_DCMI_AICORE_LIMIT_ID: dcmi_manager_sensor_id = 4;
pub const dcmi_manager_sensor_id_DCMI_AICORE_TOTAL_PER_ID: dcmi_manager_sensor_id = 5;
pub const dcmi_manager_sensor_id_DCMI_AICORE_ELIM_PER_ID: dcmi_manager_sensor_id = 6;
pub const dcmi_manager_sensor_id_DCMI_AICORE_BASE_FREQ_ID: dcmi_manager_sensor_id = 7;
pub const dcmi_manager_sensor_id_DCMI_NPU_DDR_FREQ_ID: dcmi_manager_sensor_id = 8;
pub const dcmi_manager_sensor_id_DCMI_THERMAL_THRESHOLD_ID: dcmi_manager_sensor_id = 9;
pub const dcmi_manager_sensor_id_DCMI_NTC_TEMP_ID: dcmi_manager_sensor_id = 10;
pub const dcmi_manager_sensor_id_DCMI_SOC_TEMP_ID: dcmi_manager_sensor_id = 11;
pub const dcmi_manager_sensor_id_DCMI_FP_TEMP_ID: dcmi_manager_sensor_id = 12;
pub const dcmi_manager_sensor_id_DCMI_N_DIE_TEMP_ID: dcmi_manager_sensor_id = 13;
pub const dcmi_manager_sensor_id_DCMI_HBM_TEMP_ID: dcmi_manager_sensor_id = 14;
pub const dcmi_manager_sensor_id_DCMI_SENSOR_INVALID_ID: dcmi_manager_sensor_id = 255;
pub type dcmi_manager_sensor_id = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union dcmi_sensor_info {
    pub uchar: ::std::os::raw::c_uchar,
    pub ushort: ::std::os::raw::c_ushort,
    pub uint: ::std::os::raw::c_uint,
    pub iint: ::std::os::raw::c_int,
    pub temp: [::std::os::raw::c_schar; 2usize],
    pub ntc_tmp: [::std::os::raw::c_int; 4usize],
    pub data: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_sensor_info"][::std::mem::size_of::<dcmi_sensor_info>() - 64usize];
    ["Alignment of dcmi_sensor_info"][::std::mem::align_of::<dcmi_sensor_info>() - 4usize];
    ["Offset of field: dcmi_sensor_info::uchar"]
        [::std::mem::offset_of!(dcmi_sensor_info, uchar) - 0usize];
    ["Offset of field: dcmi_sensor_info::ushort"]
        [::std::mem::offset_of!(dcmi_sensor_info, ushort) - 0usize];
    ["Offset of field: dcmi_sensor_info::uint"]
        [::std::mem::offset_of!(dcmi_sensor_info, uint) - 0usize];
    ["Offset of field: dcmi_sensor_info::iint"]
        [::std::mem::offset_of!(dcmi_sensor_info, iint) - 0usize];
    ["Offset of field: dcmi_sensor_info::temp"]
        [::std::mem::offset_of!(dcmi_sensor_info, temp) - 0usize];
    ["Offset of field: dcmi_sensor_info::ntc_tmp"]
        [::std::mem::offset_of!(dcmi_sensor_info, ntc_tmp) - 0usize];
    ["Offset of field: dcmi_sensor_info::data"]
        [::std::mem::offset_of!(dcmi_sensor_info, data) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_event_filter {
    pub filter_flag: ::std::os::raw::c_ulonglong,
    pub event_id: ::std::os::raw::c_uint,
    pub severity: ::std::os::raw::c_uchar,
    pub node_type: ::std::os::raw::c_uchar,
    #[doc = "< reserve 32byte"]
    pub resv: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_event_filter"][::std::mem::size_of::<dcmi_event_filter>() - 48usize];
    ["Alignment of dcmi_event_filter"][::std::mem::align_of::<dcmi_event_filter>() - 8usize];
    ["Offset of field: dcmi_event_filter::filter_flag"]
        [::std::mem::offset_of!(dcmi_event_filter, filter_flag) - 0usize];
    ["Offset of field: dcmi_event_filter::event_id"]
        [::std::mem::offset_of!(dcmi_event_filter, event_id) - 8usize];
    ["Offset of field: dcmi_event_filter::severity"]
        [::std::mem::offset_of!(dcmi_event_filter, severity) - 12usize];
    ["Offset of field: dcmi_event_filter::node_type"]
        [::std::mem::offset_of!(dcmi_event_filter, node_type) - 13usize];
    ["Offset of field: dcmi_event_filter::resv"]
        [::std::mem::offset_of!(dcmi_event_filter, resv) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_dms_fault_event {
    pub event_id: ::std::os::raw::c_uint,
    pub deviceid: ::std::os::raw::c_ushort,
    pub node_type: ::std::os::raw::c_uchar,
    pub node_id: ::std::os::raw::c_uchar,
    pub sub_node_type: ::std::os::raw::c_uchar,
    pub sub_node_id: ::std::os::raw::c_uchar,
    pub severity: ::std::os::raw::c_uchar,
    pub assertion: ::std::os::raw::c_uchar,
    pub event_serial_num: ::std::os::raw::c_int,
    pub notify_serial_num: ::std::os::raw::c_int,
    pub alarm_raised_time: ::std::os::raw::c_ulonglong,
    pub event_name: [::std::os::raw::c_char; 256usize],
    pub additional_info: [::std::os::raw::c_char; 32usize],
    pub os_id: ::std::os::raw::c_uchar,
    #[doc = "< os_id occupy 1 byte, reserve 31byte"]
    pub resv: [::std::os::raw::c_uchar; 31usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_dms_fault_event"][::std::mem::size_of::<dcmi_dms_fault_event>() - 352usize];
    ["Alignment of dcmi_dms_fault_event"][::std::mem::align_of::<dcmi_dms_fault_event>() - 8usize];
    ["Offset of field: dcmi_dms_fault_event::event_id"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, event_id) - 0usize];
    ["Offset of field: dcmi_dms_fault_event::deviceid"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, deviceid) - 4usize];
    ["Offset of field: dcmi_dms_fault_event::node_type"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, node_type) - 6usize];
    ["Offset of field: dcmi_dms_fault_event::node_id"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, node_id) - 7usize];
    ["Offset of field: dcmi_dms_fault_event::sub_node_type"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, sub_node_type) - 8usize];
    ["Offset of field: dcmi_dms_fault_event::sub_node_id"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, sub_node_id) - 9usize];
    ["Offset of field: dcmi_dms_fault_event::severity"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, severity) - 10usize];
    ["Offset of field: dcmi_dms_fault_event::assertion"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, assertion) - 11usize];
    ["Offset of field: dcmi_dms_fault_event::event_serial_num"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, event_serial_num) - 12usize];
    ["Offset of field: dcmi_dms_fault_event::notify_serial_num"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, notify_serial_num) - 16usize];
    ["Offset of field: dcmi_dms_fault_event::alarm_raised_time"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, alarm_raised_time) - 24usize];
    ["Offset of field: dcmi_dms_fault_event::event_name"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, event_name) - 32usize];
    ["Offset of field: dcmi_dms_fault_event::additional_info"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, additional_info) - 288usize];
    ["Offset of field: dcmi_dms_fault_event::os_id"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, os_id) - 320usize];
    ["Offset of field: dcmi_dms_fault_event::resv"]
        [::std::mem::offset_of!(dcmi_dms_fault_event, resv) - 321usize];
};
pub const dcmi_event_type_DCMI_DMS_FAULT_EVENT: dcmi_event_type = 0;
pub const dcmi_event_type_DCMI_EVENT_TYPE_MAX: dcmi_event_type = 1;
pub type dcmi_event_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dcmi_event {
    pub type_: dcmi_event_type,
    pub event_t: dcmi_event__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dcmi_event__bindgen_ty_1 {
    pub dms_event: dcmi_dms_fault_event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_event__bindgen_ty_1"]
        [::std::mem::size_of::<dcmi_event__bindgen_ty_1>() - 352usize];
    ["Alignment of dcmi_event__bindgen_ty_1"]
        [::std::mem::align_of::<dcmi_event__bindgen_ty_1>() - 8usize];
    ["Offset of field: dcmi_event__bindgen_ty_1::dms_event"]
        [::std::mem::offset_of!(dcmi_event__bindgen_ty_1, dms_event) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_event"][::std::mem::size_of::<dcmi_event>() - 360usize];
    ["Alignment of dcmi_event"][::std::mem::align_of::<dcmi_event>() - 8usize];
    ["Offset of field: dcmi_event::type_"][::std::mem::offset_of!(dcmi_event, type_) - 0usize];
    ["Offset of field: dcmi_event::event_t"][::std::mem::offset_of!(dcmi_event, event_t) - 8usize];
};
pub type dcmi_fault_event_callback =
    ::std::option::Option<unsafe extern "C" fn(event: *mut dcmi_event)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_csr_info {
    pub country_name: [::std::os::raw::c_char; 16usize],
    pub province_name: [::std::os::raw::c_char; 16usize],
    pub city_name: [::std::os::raw::c_char; 16usize],
    pub organization_name: [::std::os::raw::c_char; 16usize],
    pub department_name: [::std::os::raw::c_char; 16usize],
    pub reserve_name: [::std::os::raw::c_char; 64usize],
    pub reserve: ::std::os::raw::c_int,
    pub csr_len: ::std::os::raw::c_int,
    pub csr_data: [::std::os::raw::c_char; 2048usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_csr_info"][::std::mem::size_of::<dcmi_csr_info>() - 2200usize];
    ["Alignment of dcmi_csr_info"][::std::mem::align_of::<dcmi_csr_info>() - 4usize];
    ["Offset of field: dcmi_csr_info::country_name"]
        [::std::mem::offset_of!(dcmi_csr_info, country_name) - 0usize];
    ["Offset of field: dcmi_csr_info::province_name"]
        [::std::mem::offset_of!(dcmi_csr_info, province_name) - 16usize];
    ["Offset of field: dcmi_csr_info::city_name"]
        [::std::mem::offset_of!(dcmi_csr_info, city_name) - 32usize];
    ["Offset of field: dcmi_csr_info::organization_name"]
        [::std::mem::offset_of!(dcmi_csr_info, organization_name) - 48usize];
    ["Offset of field: dcmi_csr_info::department_name"]
        [::std::mem::offset_of!(dcmi_csr_info, department_name) - 64usize];
    ["Offset of field: dcmi_csr_info::reserve_name"]
        [::std::mem::offset_of!(dcmi_csr_info, reserve_name) - 80usize];
    ["Offset of field: dcmi_csr_info::reserve"]
        [::std::mem::offset_of!(dcmi_csr_info, reserve) - 144usize];
    ["Offset of field: dcmi_csr_info::csr_len"]
        [::std::mem::offset_of!(dcmi_csr_info, csr_len) - 148usize];
    ["Offset of field: dcmi_csr_info::csr_data"]
        [::std::mem::offset_of!(dcmi_csr_info, csr_data) - 152usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_cert_info {
    pub alarm_stat: ::std::os::raw::c_uint,
    pub reserve: ::std::os::raw::c_uint,
    pub start_time: [::std::os::raw::c_char; 32usize],
    pub end_time: [::std::os::raw::c_char; 32usize],
    pub country_name: [::std::os::raw::c_char; 16usize],
    pub province_name: [::std::os::raw::c_char; 16usize],
    pub city_name: [::std::os::raw::c_char; 16usize],
    pub organization_name: [::std::os::raw::c_char; 16usize],
    pub department_name: [::std::os::raw::c_char; 16usize],
    pub reserve_name: [::std::os::raw::c_char; 64usize],
    pub common_name: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_cert_info"][::std::mem::size_of::<dcmi_cert_info>() - 280usize];
    ["Alignment of dcmi_cert_info"][::std::mem::align_of::<dcmi_cert_info>() - 4usize];
    ["Offset of field: dcmi_cert_info::alarm_stat"]
        [::std::mem::offset_of!(dcmi_cert_info, alarm_stat) - 0usize];
    ["Offset of field: dcmi_cert_info::reserve"]
        [::std::mem::offset_of!(dcmi_cert_info, reserve) - 4usize];
    ["Offset of field: dcmi_cert_info::start_time"]
        [::std::mem::offset_of!(dcmi_cert_info, start_time) - 8usize];
    ["Offset of field: dcmi_cert_info::end_time"]
        [::std::mem::offset_of!(dcmi_cert_info, end_time) - 40usize];
    ["Offset of field: dcmi_cert_info::country_name"]
        [::std::mem::offset_of!(dcmi_cert_info, country_name) - 72usize];
    ["Offset of field: dcmi_cert_info::province_name"]
        [::std::mem::offset_of!(dcmi_cert_info, province_name) - 88usize];
    ["Offset of field: dcmi_cert_info::city_name"]
        [::std::mem::offset_of!(dcmi_cert_info, city_name) - 104usize];
    ["Offset of field: dcmi_cert_info::organization_name"]
        [::std::mem::offset_of!(dcmi_cert_info, organization_name) - 120usize];
    ["Offset of field: dcmi_cert_info::department_name"]
        [::std::mem::offset_of!(dcmi_cert_info, department_name) - 136usize];
    ["Offset of field: dcmi_cert_info::reserve_name"]
        [::std::mem::offset_of!(dcmi_cert_info, reserve_name) - 152usize];
    ["Offset of field: dcmi_cert_info::common_name"]
        [::std::mem::offset_of!(dcmi_cert_info, common_name) - 216usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct dcmi_certs_chain_data {
    pub count: ::std::os::raw::c_uint,
    pub data_len: [::std::os::raw::c_uint; 15usize],
    pub data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_certs_chain_data"][::std::mem::size_of::<dcmi_certs_chain_data>() - 64usize];
    ["Alignment of dcmi_certs_chain_data"]
        [::std::mem::align_of::<dcmi_certs_chain_data>() - 4usize];
    ["Offset of field: dcmi_certs_chain_data::count"]
        [::std::mem::offset_of!(dcmi_certs_chain_data, count) - 0usize];
    ["Offset of field: dcmi_certs_chain_data::data_len"]
        [::std::mem::offset_of!(dcmi_certs_chain_data, data_len) - 4usize];
    ["Offset of field: dcmi_certs_chain_data::data"]
        [::std::mem::offset_of!(dcmi_certs_chain_data, data) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_base_resource {
    pub token: ::std::os::raw::c_ulonglong,
    pub token_max: ::std::os::raw::c_ulonglong,
    pub task_timeout: ::std::os::raw::c_ulonglong,
    pub vfg_id: ::std::os::raw::c_uint,
    pub vip_mode: ::std::os::raw::c_uchar,
    pub reserved: [::std::os::raw::c_uchar; 31usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_base_resource"][::std::mem::size_of::<dcmi_base_resource>() - 64usize];
    ["Alignment of dcmi_base_resource"][::std::mem::align_of::<dcmi_base_resource>() - 8usize];
    ["Offset of field: dcmi_base_resource::token"]
        [::std::mem::offset_of!(dcmi_base_resource, token) - 0usize];
    ["Offset of field: dcmi_base_resource::token_max"]
        [::std::mem::offset_of!(dcmi_base_resource, token_max) - 8usize];
    ["Offset of field: dcmi_base_resource::task_timeout"]
        [::std::mem::offset_of!(dcmi_base_resource, task_timeout) - 16usize];
    ["Offset of field: dcmi_base_resource::vfg_id"]
        [::std::mem::offset_of!(dcmi_base_resource, vfg_id) - 24usize];
    ["Offset of field: dcmi_base_resource::vip_mode"]
        [::std::mem::offset_of!(dcmi_base_resource, vip_mode) - 28usize];
    ["Offset of field: dcmi_base_resource::reserved"]
        [::std::mem::offset_of!(dcmi_base_resource, reserved) - 29usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_computing_resource {
    pub aic: f32,
    pub aiv: f32,
    pub dsa: ::std::os::raw::c_ushort,
    pub rtsq: ::std::os::raw::c_ushort,
    pub acsq: ::std::os::raw::c_ushort,
    pub cdqm: ::std::os::raw::c_ushort,
    pub c_core: ::std::os::raw::c_ushort,
    pub ffts: ::std::os::raw::c_ushort,
    pub sdma: ::std::os::raw::c_ushort,
    pub pcie_dma: ::std::os::raw::c_ushort,
    pub memory_size: ::std::os::raw::c_ulonglong,
    pub event_id: ::std::os::raw::c_uint,
    pub notify_id: ::std::os::raw::c_uint,
    pub stream_id: ::std::os::raw::c_uint,
    pub model_id: ::std::os::raw::c_uint,
    pub topic_schedule_aicpu: ::std::os::raw::c_ushort,
    pub host_ctrl_cpu: ::std::os::raw::c_ushort,
    pub host_aicpu: ::std::os::raw::c_ushort,
    pub device_aicpu: ::std::os::raw::c_ushort,
    pub topic_ctrl_cpu_slot: ::std::os::raw::c_ushort,
    pub vdev_aicore_utilization: ::std::os::raw::c_uint,
    pub vdev_memory_total: ::std::os::raw::c_ulonglong,
    pub vdev_memory_free: ::std::os::raw::c_ulonglong,
    pub reserved: [::std::os::raw::c_uchar; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_computing_resource"][::std::mem::size_of::<dcmi_computing_resource>() - 96usize];
    ["Alignment of dcmi_computing_resource"]
        [::std::mem::align_of::<dcmi_computing_resource>() - 8usize];
    ["Offset of field: dcmi_computing_resource::aic"]
        [::std::mem::offset_of!(dcmi_computing_resource, aic) - 0usize];
    ["Offset of field: dcmi_computing_resource::aiv"]
        [::std::mem::offset_of!(dcmi_computing_resource, aiv) - 4usize];
    ["Offset of field: dcmi_computing_resource::dsa"]
        [::std::mem::offset_of!(dcmi_computing_resource, dsa) - 8usize];
    ["Offset of field: dcmi_computing_resource::rtsq"]
        [::std::mem::offset_of!(dcmi_computing_resource, rtsq) - 10usize];
    ["Offset of field: dcmi_computing_resource::acsq"]
        [::std::mem::offset_of!(dcmi_computing_resource, acsq) - 12usize];
    ["Offset of field: dcmi_computing_resource::cdqm"]
        [::std::mem::offset_of!(dcmi_computing_resource, cdqm) - 14usize];
    ["Offset of field: dcmi_computing_resource::c_core"]
        [::std::mem::offset_of!(dcmi_computing_resource, c_core) - 16usize];
    ["Offset of field: dcmi_computing_resource::ffts"]
        [::std::mem::offset_of!(dcmi_computing_resource, ffts) - 18usize];
    ["Offset of field: dcmi_computing_resource::sdma"]
        [::std::mem::offset_of!(dcmi_computing_resource, sdma) - 20usize];
    ["Offset of field: dcmi_computing_resource::pcie_dma"]
        [::std::mem::offset_of!(dcmi_computing_resource, pcie_dma) - 22usize];
    ["Offset of field: dcmi_computing_resource::memory_size"]
        [::std::mem::offset_of!(dcmi_computing_resource, memory_size) - 24usize];
    ["Offset of field: dcmi_computing_resource::event_id"]
        [::std::mem::offset_of!(dcmi_computing_resource, event_id) - 32usize];
    ["Offset of field: dcmi_computing_resource::notify_id"]
        [::std::mem::offset_of!(dcmi_computing_resource, notify_id) - 36usize];
    ["Offset of field: dcmi_computing_resource::stream_id"]
        [::std::mem::offset_of!(dcmi_computing_resource, stream_id) - 40usize];
    ["Offset of field: dcmi_computing_resource::model_id"]
        [::std::mem::offset_of!(dcmi_computing_resource, model_id) - 44usize];
    ["Offset of field: dcmi_computing_resource::topic_schedule_aicpu"]
        [::std::mem::offset_of!(dcmi_computing_resource, topic_schedule_aicpu) - 48usize];
    ["Offset of field: dcmi_computing_resource::host_ctrl_cpu"]
        [::std::mem::offset_of!(dcmi_computing_resource, host_ctrl_cpu) - 50usize];
    ["Offset of field: dcmi_computing_resource::host_aicpu"]
        [::std::mem::offset_of!(dcmi_computing_resource, host_aicpu) - 52usize];
    ["Offset of field: dcmi_computing_resource::device_aicpu"]
        [::std::mem::offset_of!(dcmi_computing_resource, device_aicpu) - 54usize];
    ["Offset of field: dcmi_computing_resource::topic_ctrl_cpu_slot"]
        [::std::mem::offset_of!(dcmi_computing_resource, topic_ctrl_cpu_slot) - 56usize];
    ["Offset of field: dcmi_computing_resource::vdev_aicore_utilization"]
        [::std::mem::offset_of!(dcmi_computing_resource, vdev_aicore_utilization) - 60usize];
    ["Offset of field: dcmi_computing_resource::vdev_memory_total"]
        [::std::mem::offset_of!(dcmi_computing_resource, vdev_memory_total) - 64usize];
    ["Offset of field: dcmi_computing_resource::vdev_memory_free"]
        [::std::mem::offset_of!(dcmi_computing_resource, vdev_memory_free) - 72usize];
    ["Offset of field: dcmi_computing_resource::reserved"]
        [::std::mem::offset_of!(dcmi_computing_resource, reserved) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_computing_configurable {
    pub memory_size: ::std::os::raw::c_ulonglong,
    pub aic: f32,
    pub aiv: f32,
    pub dsa: ::std::os::raw::c_ushort,
    pub rtsq: ::std::os::raw::c_ushort,
    pub cdqm: ::std::os::raw::c_ushort,
    pub topic_schedule_aicpu: ::std::os::raw::c_ushort,
    pub host_ctrl_cpu: ::std::os::raw::c_ushort,
    pub host_aicpu: ::std::os::raw::c_ushort,
    pub device_aicpu: ::std::os::raw::c_ushort,
    pub reserved: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_computing_configurable"]
        [::std::mem::size_of::<dcmi_computing_configurable>() - 64usize];
    ["Alignment of dcmi_computing_configurable"]
        [::std::mem::align_of::<dcmi_computing_configurable>() - 8usize];
    ["Offset of field: dcmi_computing_configurable::memory_size"]
        [::std::mem::offset_of!(dcmi_computing_configurable, memory_size) - 0usize];
    ["Offset of field: dcmi_computing_configurable::aic"]
        [::std::mem::offset_of!(dcmi_computing_configurable, aic) - 8usize];
    ["Offset of field: dcmi_computing_configurable::aiv"]
        [::std::mem::offset_of!(dcmi_computing_configurable, aiv) - 12usize];
    ["Offset of field: dcmi_computing_configurable::dsa"]
        [::std::mem::offset_of!(dcmi_computing_configurable, dsa) - 16usize];
    ["Offset of field: dcmi_computing_configurable::rtsq"]
        [::std::mem::offset_of!(dcmi_computing_configurable, rtsq) - 18usize];
    ["Offset of field: dcmi_computing_configurable::cdqm"]
        [::std::mem::offset_of!(dcmi_computing_configurable, cdqm) - 20usize];
    ["Offset of field: dcmi_computing_configurable::topic_schedule_aicpu"]
        [::std::mem::offset_of!(dcmi_computing_configurable, topic_schedule_aicpu) - 22usize];
    ["Offset of field: dcmi_computing_configurable::host_ctrl_cpu"]
        [::std::mem::offset_of!(dcmi_computing_configurable, host_ctrl_cpu) - 24usize];
    ["Offset of field: dcmi_computing_configurable::host_aicpu"]
        [::std::mem::offset_of!(dcmi_computing_configurable, host_aicpu) - 26usize];
    ["Offset of field: dcmi_computing_configurable::device_aicpu"]
        [::std::mem::offset_of!(dcmi_computing_configurable, device_aicpu) - 28usize];
    ["Offset of field: dcmi_computing_configurable::reserved"]
        [::std::mem::offset_of!(dcmi_computing_configurable, reserved) - 30usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_media_resource {
    pub jpegd: f32,
    pub jpege: f32,
    pub vpc: f32,
    pub vdec: f32,
    pub pngd: f32,
    pub venc: f32,
    pub reserved: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_media_resource"][::std::mem::size_of::<dcmi_media_resource>() - 56usize];
    ["Alignment of dcmi_media_resource"][::std::mem::align_of::<dcmi_media_resource>() - 4usize];
    ["Offset of field: dcmi_media_resource::jpegd"]
        [::std::mem::offset_of!(dcmi_media_resource, jpegd) - 0usize];
    ["Offset of field: dcmi_media_resource::jpege"]
        [::std::mem::offset_of!(dcmi_media_resource, jpege) - 4usize];
    ["Offset of field: dcmi_media_resource::vpc"]
        [::std::mem::offset_of!(dcmi_media_resource, vpc) - 8usize];
    ["Offset of field: dcmi_media_resource::vdec"]
        [::std::mem::offset_of!(dcmi_media_resource, vdec) - 12usize];
    ["Offset of field: dcmi_media_resource::pngd"]
        [::std::mem::offset_of!(dcmi_media_resource, pngd) - 16usize];
    ["Offset of field: dcmi_media_resource::venc"]
        [::std::mem::offset_of!(dcmi_media_resource, venc) - 20usize];
    ["Offset of field: dcmi_media_resource::reserved"]
        [::std::mem::offset_of!(dcmi_media_resource, reserved) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_create_vdev_in {
    pub name: [::std::os::raw::c_char; 16usize],
    pub base: dcmi_base_resource,
    pub computing: dcmi_computing_configurable,
    pub media: dcmi_media_resource,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_create_vdev_in"][::std::mem::size_of::<dcmi_create_vdev_in>() - 200usize];
    ["Alignment of dcmi_create_vdev_in"][::std::mem::align_of::<dcmi_create_vdev_in>() - 8usize];
    ["Offset of field: dcmi_create_vdev_in::name"]
        [::std::mem::offset_of!(dcmi_create_vdev_in, name) - 0usize];
    ["Offset of field: dcmi_create_vdev_in::base"]
        [::std::mem::offset_of!(dcmi_create_vdev_in, base) - 16usize];
    ["Offset of field: dcmi_create_vdev_in::computing"]
        [::std::mem::offset_of!(dcmi_create_vdev_in, computing) - 80usize];
    ["Offset of field: dcmi_create_vdev_in::media"]
        [::std::mem::offset_of!(dcmi_create_vdev_in, media) - 144usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_create_vdev_out {
    pub vdev_id: ::std::os::raw::c_uint,
    pub pcie_bus: ::std::os::raw::c_uint,
    pub pcie_device: ::std::os::raw::c_uint,
    pub pcie_func: ::std::os::raw::c_uint,
    pub vfg_id: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_create_vdev_out"][::std::mem::size_of::<dcmi_create_vdev_out>() - 52usize];
    ["Alignment of dcmi_create_vdev_out"][::std::mem::align_of::<dcmi_create_vdev_out>() - 4usize];
    ["Offset of field: dcmi_create_vdev_out::vdev_id"]
        [::std::mem::offset_of!(dcmi_create_vdev_out, vdev_id) - 0usize];
    ["Offset of field: dcmi_create_vdev_out::pcie_bus"]
        [::std::mem::offset_of!(dcmi_create_vdev_out, pcie_bus) - 4usize];
    ["Offset of field: dcmi_create_vdev_out::pcie_device"]
        [::std::mem::offset_of!(dcmi_create_vdev_out, pcie_device) - 8usize];
    ["Offset of field: dcmi_create_vdev_out::pcie_func"]
        [::std::mem::offset_of!(dcmi_create_vdev_out, pcie_func) - 12usize];
    ["Offset of field: dcmi_create_vdev_out::vfg_id"]
        [::std::mem::offset_of!(dcmi_create_vdev_out, vfg_id) - 16usize];
    ["Offset of field: dcmi_create_vdev_out::reserved"]
        [::std::mem::offset_of!(dcmi_create_vdev_out, reserved) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_create_vdev_res_stru {
    pub vdev_id: ::std::os::raw::c_uint,
    pub vfg_id: ::std::os::raw::c_uint,
    pub template_name: [::std::os::raw::c_char; 32usize],
    pub reserved: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_create_vdev_res_stru"]
        [::std::mem::size_of::<dcmi_create_vdev_res_stru>() - 104usize];
    ["Alignment of dcmi_create_vdev_res_stru"]
        [::std::mem::align_of::<dcmi_create_vdev_res_stru>() - 4usize];
    ["Offset of field: dcmi_create_vdev_res_stru::vdev_id"]
        [::std::mem::offset_of!(dcmi_create_vdev_res_stru, vdev_id) - 0usize];
    ["Offset of field: dcmi_create_vdev_res_stru::vfg_id"]
        [::std::mem::offset_of!(dcmi_create_vdev_res_stru, vfg_id) - 4usize];
    ["Offset of field: dcmi_create_vdev_res_stru::template_name"]
        [::std::mem::offset_of!(dcmi_create_vdev_res_stru, template_name) - 8usize];
    ["Offset of field: dcmi_create_vdev_res_stru::reserved"]
        [::std::mem::offset_of!(dcmi_create_vdev_res_stru, reserved) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_vdev_query_info {
    pub name: [::std::os::raw::c_char; 16usize],
    pub status: ::std::os::raw::c_uint,
    pub is_container_used: ::std::os::raw::c_uint,
    pub vfid: ::std::os::raw::c_uint,
    pub vfg_id: ::std::os::raw::c_uint,
    pub container_id: ::std::os::raw::c_ulonglong,
    pub base: dcmi_base_resource,
    pub computing: dcmi_computing_resource,
    pub media: dcmi_media_resource,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_vdev_query_info"][::std::mem::size_of::<dcmi_vdev_query_info>() - 256usize];
    ["Alignment of dcmi_vdev_query_info"][::std::mem::align_of::<dcmi_vdev_query_info>() - 8usize];
    ["Offset of field: dcmi_vdev_query_info::name"]
        [::std::mem::offset_of!(dcmi_vdev_query_info, name) - 0usize];
    ["Offset of field: dcmi_vdev_query_info::status"]
        [::std::mem::offset_of!(dcmi_vdev_query_info, status) - 16usize];
    ["Offset of field: dcmi_vdev_query_info::is_container_used"]
        [::std::mem::offset_of!(dcmi_vdev_query_info, is_container_used) - 20usize];
    ["Offset of field: dcmi_vdev_query_info::vfid"]
        [::std::mem::offset_of!(dcmi_vdev_query_info, vfid) - 24usize];
    ["Offset of field: dcmi_vdev_query_info::vfg_id"]
        [::std::mem::offset_of!(dcmi_vdev_query_info, vfg_id) - 28usize];
    ["Offset of field: dcmi_vdev_query_info::container_id"]
        [::std::mem::offset_of!(dcmi_vdev_query_info, container_id) - 32usize];
    ["Offset of field: dcmi_vdev_query_info::base"]
        [::std::mem::offset_of!(dcmi_vdev_query_info, base) - 40usize];
    ["Offset of field: dcmi_vdev_query_info::computing"]
        [::std::mem::offset_of!(dcmi_vdev_query_info, computing) - 104usize];
    ["Offset of field: dcmi_vdev_query_info::media"]
        [::std::mem::offset_of!(dcmi_vdev_query_info, media) - 200usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_vdev_query_stru {
    pub vdev_id: ::std::os::raw::c_uint,
    pub query_info: dcmi_vdev_query_info,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_vdev_query_stru"][::std::mem::size_of::<dcmi_vdev_query_stru>() - 264usize];
    ["Alignment of dcmi_vdev_query_stru"][::std::mem::align_of::<dcmi_vdev_query_stru>() - 8usize];
    ["Offset of field: dcmi_vdev_query_stru::vdev_id"]
        [::std::mem::offset_of!(dcmi_vdev_query_stru, vdev_id) - 0usize];
    ["Offset of field: dcmi_vdev_query_stru::query_info"]
        [::std::mem::offset_of!(dcmi_vdev_query_stru, query_info) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_soc_free_resource {
    pub vfg_num: ::std::os::raw::c_uint,
    pub vfg_bitmap: ::std::os::raw::c_uint,
    pub base: dcmi_base_resource,
    pub computing: dcmi_computing_resource,
    pub media: dcmi_media_resource,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_soc_free_resource"][::std::mem::size_of::<dcmi_soc_free_resource>() - 224usize];
    ["Alignment of dcmi_soc_free_resource"]
        [::std::mem::align_of::<dcmi_soc_free_resource>() - 8usize];
    ["Offset of field: dcmi_soc_free_resource::vfg_num"]
        [::std::mem::offset_of!(dcmi_soc_free_resource, vfg_num) - 0usize];
    ["Offset of field: dcmi_soc_free_resource::vfg_bitmap"]
        [::std::mem::offset_of!(dcmi_soc_free_resource, vfg_bitmap) - 4usize];
    ["Offset of field: dcmi_soc_free_resource::base"]
        [::std::mem::offset_of!(dcmi_soc_free_resource, base) - 8usize];
    ["Offset of field: dcmi_soc_free_resource::computing"]
        [::std::mem::offset_of!(dcmi_soc_free_resource, computing) - 72usize];
    ["Offset of field: dcmi_soc_free_resource::media"]
        [::std::mem::offset_of!(dcmi_soc_free_resource, media) - 168usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_soc_total_resource {
    pub vdev_num: ::std::os::raw::c_uint,
    pub vdev_id: [::std::os::raw::c_uint; 32usize],
    pub vfg_num: ::std::os::raw::c_uint,
    pub vfg_bitmap: ::std::os::raw::c_uint,
    pub base: dcmi_base_resource,
    pub computing: dcmi_computing_resource,
    pub media: dcmi_media_resource,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_soc_total_resource"]
        [::std::mem::size_of::<dcmi_soc_total_resource>() - 360usize];
    ["Alignment of dcmi_soc_total_resource"]
        [::std::mem::align_of::<dcmi_soc_total_resource>() - 8usize];
    ["Offset of field: dcmi_soc_total_resource::vdev_num"]
        [::std::mem::offset_of!(dcmi_soc_total_resource, vdev_num) - 0usize];
    ["Offset of field: dcmi_soc_total_resource::vdev_id"]
        [::std::mem::offset_of!(dcmi_soc_total_resource, vdev_id) - 4usize];
    ["Offset of field: dcmi_soc_total_resource::vfg_num"]
        [::std::mem::offset_of!(dcmi_soc_total_resource, vfg_num) - 132usize];
    ["Offset of field: dcmi_soc_total_resource::vfg_bitmap"]
        [::std::mem::offset_of!(dcmi_soc_total_resource, vfg_bitmap) - 136usize];
    ["Offset of field: dcmi_soc_total_resource::base"]
        [::std::mem::offset_of!(dcmi_soc_total_resource, base) - 144usize];
    ["Offset of field: dcmi_soc_total_resource::computing"]
        [::std::mem::offset_of!(dcmi_soc_total_resource, computing) - 208usize];
    ["Offset of field: dcmi_soc_total_resource::media"]
        [::std::mem::offset_of!(dcmi_soc_total_resource, media) - 304usize];
};
pub const DCMI_POWER_STATE_DCMI_POWER_STATE_SUSPEND: DCMI_POWER_STATE = 0;
pub const DCMI_POWER_STATE_DCMI_POWER_STATE_POWEROFF: DCMI_POWER_STATE = 1;
pub const DCMI_POWER_STATE_DCMI_POWER_STATE_RESET: DCMI_POWER_STATE = 2;
pub const DCMI_POWER_STATE_DCMI_POWER_STATE_BIST: DCMI_POWER_STATE = 3;
pub const DCMI_POWER_STATE_DCMI_POWER_STATE_MAX: DCMI_POWER_STATE = 4;
pub type DCMI_POWER_STATE = ::std::os::raw::c_uint;
pub const DCMI_LP_RESUME_MODE_DCMI_POWER_RESUME_MODE_BUTTON: DCMI_LP_RESUME_MODE = 0;
pub const DCMI_LP_RESUME_MODE_DCMI_POWER_RESUME_MODE_TIME: DCMI_LP_RESUME_MODE = 1;
pub const DCMI_LP_RESUME_MODE_DCMI_POWER_RESUME_MODE_MAX: DCMI_LP_RESUME_MODE = 2;
pub type DCMI_LP_RESUME_MODE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_power_state_info_stru {
    pub type_: DCMI_POWER_STATE,
    pub mode: DCMI_LP_RESUME_MODE,
    pub value: ::std::os::raw::c_uint,
    pub reserve: [::std::os::raw::c_uint; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_power_state_info_stru"]
        [::std::mem::size_of::<dcmi_power_state_info_stru>() - 44usize];
    ["Alignment of dcmi_power_state_info_stru"]
        [::std::mem::align_of::<dcmi_power_state_info_stru>() - 4usize];
    ["Offset of field: dcmi_power_state_info_stru::type_"]
        [::std::mem::offset_of!(dcmi_power_state_info_stru, type_) - 0usize];
    ["Offset of field: dcmi_power_state_info_stru::mode"]
        [::std::mem::offset_of!(dcmi_power_state_info_stru, mode) - 4usize];
    ["Offset of field: dcmi_power_state_info_stru::value"]
        [::std::mem::offset_of!(dcmi_power_state_info_stru, value) - 8usize];
    ["Offset of field: dcmi_power_state_info_stru::reserve"]
        [::std::mem::offset_of!(dcmi_power_state_info_stru, reserve) - 12usize];
};
pub const ECC_INFO_READ_MULTI_ECC_TIMES_READ: ECC_INFO_READ = 0;
pub const ECC_INFO_READ_SINGLE_ECC_INFO_READ: ECC_INFO_READ = 1;
pub const ECC_INFO_READ_MULTI_ECC_INFO_READ: ECC_INFO_READ = 2;
pub const ECC_INFO_READ_ECC_ADDRESS_COUNT_READ: ECC_INFO_READ = 3;
pub const ECC_INFO_READ_ECC_MAX_READ_CMD: ECC_INFO_READ = 4;
pub type ECC_INFO_READ = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ecc_record_type {
    pub read_type: ECC_INFO_READ,
    pub module_type: dcmi_device_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ecc_record_type"][::std::mem::size_of::<dcmi_ecc_record_type>() - 8usize];
    ["Alignment of dcmi_ecc_record_type"][::std::mem::align_of::<dcmi_ecc_record_type>() - 4usize];
    ["Offset of field: dcmi_ecc_record_type::read_type"]
        [::std::mem::offset_of!(dcmi_ecc_record_type, read_type) - 0usize];
    ["Offset of field: dcmi_ecc_record_type::module_type"]
        [::std::mem::offset_of!(dcmi_ecc_record_type, module_type) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_multi_ecc_time_data {
    pub multi_record_count: ::std::os::raw::c_uint,
    pub multi_ecc_times: [::std::os::raw::c_uint; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_multi_ecc_time_data"]
        [::std::mem::size_of::<dcmi_multi_ecc_time_data>() - 260usize];
    ["Alignment of dcmi_multi_ecc_time_data"]
        [::std::mem::align_of::<dcmi_multi_ecc_time_data>() - 1usize];
    ["Offset of field: dcmi_multi_ecc_time_data::multi_record_count"]
        [::std::mem::offset_of!(dcmi_multi_ecc_time_data, multi_record_count) - 0usize];
    ["Offset of field: dcmi_multi_ecc_time_data::multi_ecc_times"]
        [::std::mem::offset_of!(dcmi_multi_ecc_time_data, multi_ecc_times) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ecc_common_data {
    pub physical_addr: ::std::os::raw::c_ulonglong,
    pub stack_pc_id: ::std::os::raw::c_uint,
    pub reg_addr_h: ::std::os::raw::c_uint,
    pub reg_addr_l: ::std::os::raw::c_uint,
    pub ecc_count: ::std::os::raw::c_uint,
    pub timestamp: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ecc_common_data"][::std::mem::size_of::<dcmi_ecc_common_data>() - 28usize];
    ["Alignment of dcmi_ecc_common_data"][::std::mem::align_of::<dcmi_ecc_common_data>() - 1usize];
    ["Offset of field: dcmi_ecc_common_data::physical_addr"]
        [::std::mem::offset_of!(dcmi_ecc_common_data, physical_addr) - 0usize];
    ["Offset of field: dcmi_ecc_common_data::stack_pc_id"]
        [::std::mem::offset_of!(dcmi_ecc_common_data, stack_pc_id) - 8usize];
    ["Offset of field: dcmi_ecc_common_data::reg_addr_h"]
        [::std::mem::offset_of!(dcmi_ecc_common_data, reg_addr_h) - 12usize];
    ["Offset of field: dcmi_ecc_common_data::reg_addr_l"]
        [::std::mem::offset_of!(dcmi_ecc_common_data, reg_addr_l) - 16usize];
    ["Offset of field: dcmi_ecc_common_data::ecc_count"]
        [::std::mem::offset_of!(dcmi_ecc_common_data, ecc_count) - 20usize];
    ["Offset of field: dcmi_ecc_common_data::timestamp"]
        [::std::mem::offset_of!(dcmi_ecc_common_data, timestamp) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_pcie_link_bandwidth_info {
    pub profiling_time: ::std::os::raw::c_int,
    pub tx_p_bw: [::std::os::raw::c_uint; 3usize],
    pub tx_np_bw: [::std::os::raw::c_uint; 3usize],
    pub tx_cpl_bw: [::std::os::raw::c_uint; 3usize],
    pub tx_np_lantency: [::std::os::raw::c_uint; 3usize],
    pub rx_p_bw: [::std::os::raw::c_uint; 3usize],
    pub rx_np_bw: [::std::os::raw::c_uint; 3usize],
    pub rx_cpl_bw: [::std::os::raw::c_uint; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_pcie_link_bandwidth_info"]
        [::std::mem::size_of::<dcmi_pcie_link_bandwidth_info>() - 88usize];
    ["Alignment of dcmi_pcie_link_bandwidth_info"]
        [::std::mem::align_of::<dcmi_pcie_link_bandwidth_info>() - 4usize];
    ["Offset of field: dcmi_pcie_link_bandwidth_info::profiling_time"]
        [::std::mem::offset_of!(dcmi_pcie_link_bandwidth_info, profiling_time) - 0usize];
    ["Offset of field: dcmi_pcie_link_bandwidth_info::tx_p_bw"]
        [::std::mem::offset_of!(dcmi_pcie_link_bandwidth_info, tx_p_bw) - 4usize];
    ["Offset of field: dcmi_pcie_link_bandwidth_info::tx_np_bw"]
        [::std::mem::offset_of!(dcmi_pcie_link_bandwidth_info, tx_np_bw) - 16usize];
    ["Offset of field: dcmi_pcie_link_bandwidth_info::tx_cpl_bw"]
        [::std::mem::offset_of!(dcmi_pcie_link_bandwidth_info, tx_cpl_bw) - 28usize];
    ["Offset of field: dcmi_pcie_link_bandwidth_info::tx_np_lantency"]
        [::std::mem::offset_of!(dcmi_pcie_link_bandwidth_info, tx_np_lantency) - 40usize];
    ["Offset of field: dcmi_pcie_link_bandwidth_info::rx_p_bw"]
        [::std::mem::offset_of!(dcmi_pcie_link_bandwidth_info, rx_p_bw) - 52usize];
    ["Offset of field: dcmi_pcie_link_bandwidth_info::rx_np_bw"]
        [::std::mem::offset_of!(dcmi_pcie_link_bandwidth_info, rx_np_bw) - 64usize];
    ["Offset of field: dcmi_pcie_link_bandwidth_info::rx_cpl_bw"]
        [::std::mem::offset_of!(dcmi_pcie_link_bandwidth_info, rx_cpl_bw) - 76usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_serdes_quality_base {
    pub snr: ::std::os::raw::c_uint,
    pub heh: ::std::os::raw::c_uint,
    pub bottom: ::std::os::raw::c_int,
    pub top: ::std::os::raw::c_int,
    pub left: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_serdes_quality_base"]
        [::std::mem::size_of::<dcmi_serdes_quality_base>() - 24usize];
    ["Alignment of dcmi_serdes_quality_base"]
        [::std::mem::align_of::<dcmi_serdes_quality_base>() - 4usize];
    ["Offset of field: dcmi_serdes_quality_base::snr"]
        [::std::mem::offset_of!(dcmi_serdes_quality_base, snr) - 0usize];
    ["Offset of field: dcmi_serdes_quality_base::heh"]
        [::std::mem::offset_of!(dcmi_serdes_quality_base, heh) - 4usize];
    ["Offset of field: dcmi_serdes_quality_base::bottom"]
        [::std::mem::offset_of!(dcmi_serdes_quality_base, bottom) - 8usize];
    ["Offset of field: dcmi_serdes_quality_base::top"]
        [::std::mem::offset_of!(dcmi_serdes_quality_base, top) - 12usize];
    ["Offset of field: dcmi_serdes_quality_base::left"]
        [::std::mem::offset_of!(dcmi_serdes_quality_base, left) - 16usize];
    ["Offset of field: dcmi_serdes_quality_base::right"]
        [::std::mem::offset_of!(dcmi_serdes_quality_base, right) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_serdes_quality_info {
    pub macro_id: ::std::os::raw::c_uint,
    pub reserved1: ::std::os::raw::c_uint,
    pub serdes_quality_info: [dcmi_serdes_quality_base; 8usize],
    pub reserved2: [::std::os::raw::c_uint; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_serdes_quality_info"]
        [::std::mem::size_of::<dcmi_serdes_quality_info>() - 456usize];
    ["Alignment of dcmi_serdes_quality_info"]
        [::std::mem::align_of::<dcmi_serdes_quality_info>() - 4usize];
    ["Offset of field: dcmi_serdes_quality_info::macro_id"]
        [::std::mem::offset_of!(dcmi_serdes_quality_info, macro_id) - 0usize];
    ["Offset of field: dcmi_serdes_quality_info::reserved1"]
        [::std::mem::offset_of!(dcmi_serdes_quality_info, reserved1) - 4usize];
    ["Offset of field: dcmi_serdes_quality_info::serdes_quality_info"]
        [::std::mem::offset_of!(dcmi_serdes_quality_info, serdes_quality_info) - 8usize];
    ["Offset of field: dcmi_serdes_quality_info::reserved2"]
        [::std::mem::offset_of!(dcmi_serdes_quality_info, reserved2) - 200usize];
};
pub type DCMI_SERDES_QUALITY_INFO = dcmi_serdes_quality_info;
pub const DCMI_TOPO_TYPE_SELF: _bindgen_ty_1 = 0;
pub const DCMI_TOPO_TYPE_SYS: _bindgen_ty_1 = 1;
pub const DCMI_TOPO_TYPE_PHB: _bindgen_ty_1 = 2;
pub const DCMI_TOPO_TYPE_HCCS: _bindgen_ty_1 = 3;
pub const DCMI_TOPO_TYPE_PXB: _bindgen_ty_1 = 4;
pub const DCMI_TOPO_TYPE_PIX: _bindgen_ty_1 = 5;
pub const DCMI_TOPO_TYPE_SIO: _bindgen_ty_1 = 6;
pub const DCMI_TOPO_TYPE_HCCS_SW: _bindgen_ty_1 = 7;
pub const DCMI_TOPO_TYPE_BUTT: _bindgen_ty_1 = 8;
pub const DCMI_TOPO_TYOE_MAX: _bindgen_ty_1 = 9;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_network_rdma_bandwidth_info {
    pub tx_bandwidth: ::std::os::raw::c_uint,
    pub rx_bandwidth: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_network_rdma_bandwidth_info"]
        [::std::mem::size_of::<dcmi_network_rdma_bandwidth_info>() - 8usize];
    ["Alignment of dcmi_network_rdma_bandwidth_info"]
        [::std::mem::align_of::<dcmi_network_rdma_bandwidth_info>() - 4usize];
    ["Offset of field: dcmi_network_rdma_bandwidth_info::tx_bandwidth"]
        [::std::mem::offset_of!(dcmi_network_rdma_bandwidth_info, tx_bandwidth) - 0usize];
    ["Offset of field: dcmi_network_rdma_bandwidth_info::rx_bandwidth"]
        [::std::mem::offset_of!(dcmi_network_rdma_bandwidth_info, rx_bandwidth) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_network_pkt_stats_info {
    pub mac_tx_mac_pause_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_mac_pause_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_pfc_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_pfc_pri0_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_pfc_pri1_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_pfc_pri2_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_pfc_pri3_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_pfc_pri4_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_pfc_pri5_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_pfc_pri6_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_pfc_pri7_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_pfc_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_pfc_pri0_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_pfc_pri1_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_pfc_pri2_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_pfc_pri3_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_pfc_pri4_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_pfc_pri5_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_pfc_pri6_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_pfc_pri7_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_total_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_total_oct_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_bad_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_tx_bad_oct_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_total_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_total_oct_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_bad_pkt_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_bad_oct_num: ::std::os::raw::c_ulonglong,
    pub mac_rx_fcs_err_pkt_num: ::std::os::raw::c_ulonglong,
    pub roce_rx_rc_pkt_num: ::std::os::raw::c_ulonglong,
    pub roce_rx_all_pkt_num: ::std::os::raw::c_ulonglong,
    pub roce_rx_err_pkt_num: ::std::os::raw::c_ulonglong,
    pub roce_tx_rc_pkt_num: ::std::os::raw::c_ulonglong,
    pub roce_tx_all_pkt_num: ::std::os::raw::c_ulonglong,
    pub roce_tx_err_pkt_num: ::std::os::raw::c_ulonglong,
    pub roce_cqe_num: ::std::os::raw::c_ulonglong,
    pub roce_rx_cnp_pkt_num: ::std::os::raw::c_ulonglong,
    pub roce_tx_cnp_pkt_num: ::std::os::raw::c_ulonglong,
    pub roce_err_ack_num: ::std::os::raw::c_ulonglong,
    pub roce_err_psn_num: ::std::os::raw::c_ulonglong,
    pub roce_verification_err_num: ::std::os::raw::c_ulonglong,
    pub roce_err_qp_status_num: ::std::os::raw::c_ulonglong,
    pub roce_new_pkt_rty_num: ::std::os::raw::c_ulonglong,
    pub roce_ecn_db_num: ::std::os::raw::c_ulonglong,
    pub nic_tx_all_pkg_num: ::std::os::raw::c_ulonglong,
    pub nic_tx_all_oct_num: ::std::os::raw::c_ulonglong,
    pub nic_rx_all_pkg_num: ::std::os::raw::c_ulonglong,
    pub nic_rx_all_oct_num: ::std::os::raw::c_ulonglong,
    pub tv_sec: ::std::os::raw::c_long,
    pub tv_usec: ::std::os::raw::c_long,
    pub reserved: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_network_pkt_stats_info"]
        [::std::mem::size_of::<dcmi_network_pkt_stats_info>() - 464usize];
    ["Alignment of dcmi_network_pkt_stats_info"]
        [::std::mem::align_of::<dcmi_network_pkt_stats_info>() - 8usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_mac_pause_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_mac_pause_num) - 0usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_mac_pause_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_mac_pause_num) - 8usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_pfc_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_pfc_pkt_num) - 16usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_pfc_pri0_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_pfc_pri0_pkt_num) - 24usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_pfc_pri1_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_pfc_pri1_pkt_num) - 32usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_pfc_pri2_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_pfc_pri2_pkt_num) - 40usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_pfc_pri3_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_pfc_pri3_pkt_num) - 48usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_pfc_pri4_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_pfc_pri4_pkt_num) - 56usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_pfc_pri5_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_pfc_pri5_pkt_num) - 64usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_pfc_pri6_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_pfc_pri6_pkt_num) - 72usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_pfc_pri7_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_pfc_pri7_pkt_num) - 80usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_pfc_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_pfc_pkt_num) - 88usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_pfc_pri0_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_pfc_pri0_pkt_num) - 96usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_pfc_pri1_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_pfc_pri1_pkt_num) - 104usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_pfc_pri2_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_pfc_pri2_pkt_num) - 112usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_pfc_pri3_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_pfc_pri3_pkt_num) - 120usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_pfc_pri4_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_pfc_pri4_pkt_num) - 128usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_pfc_pri5_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_pfc_pri5_pkt_num) - 136usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_pfc_pri6_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_pfc_pri6_pkt_num) - 144usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_pfc_pri7_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_pfc_pri7_pkt_num) - 152usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_total_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_total_pkt_num) - 160usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_total_oct_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_total_oct_num) - 168usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_bad_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_bad_pkt_num) - 176usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_tx_bad_oct_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_tx_bad_oct_num) - 184usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_total_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_total_pkt_num) - 192usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_total_oct_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_total_oct_num) - 200usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_bad_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_bad_pkt_num) - 208usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_bad_oct_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_bad_oct_num) - 216usize];
    ["Offset of field: dcmi_network_pkt_stats_info::mac_rx_fcs_err_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, mac_rx_fcs_err_pkt_num) - 224usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_rx_rc_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_rx_rc_pkt_num) - 232usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_rx_all_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_rx_all_pkt_num) - 240usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_rx_err_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_rx_err_pkt_num) - 248usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_tx_rc_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_tx_rc_pkt_num) - 256usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_tx_all_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_tx_all_pkt_num) - 264usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_tx_err_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_tx_err_pkt_num) - 272usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_cqe_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_cqe_num) - 280usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_rx_cnp_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_rx_cnp_pkt_num) - 288usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_tx_cnp_pkt_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_tx_cnp_pkt_num) - 296usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_err_ack_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_err_ack_num) - 304usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_err_psn_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_err_psn_num) - 312usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_verification_err_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_verification_err_num) - 320usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_err_qp_status_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_err_qp_status_num) - 328usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_new_pkt_rty_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_new_pkt_rty_num) - 336usize];
    ["Offset of field: dcmi_network_pkt_stats_info::roce_ecn_db_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, roce_ecn_db_num) - 344usize];
    ["Offset of field: dcmi_network_pkt_stats_info::nic_tx_all_pkg_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, nic_tx_all_pkg_num) - 352usize];
    ["Offset of field: dcmi_network_pkt_stats_info::nic_tx_all_oct_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, nic_tx_all_oct_num) - 360usize];
    ["Offset of field: dcmi_network_pkt_stats_info::nic_rx_all_pkg_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, nic_rx_all_pkg_num) - 368usize];
    ["Offset of field: dcmi_network_pkt_stats_info::nic_rx_all_oct_num"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, nic_rx_all_oct_num) - 376usize];
    ["Offset of field: dcmi_network_pkt_stats_info::tv_sec"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, tv_sec) - 384usize];
    ["Offset of field: dcmi_network_pkt_stats_info::tv_usec"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, tv_usec) - 392usize];
    ["Offset of field: dcmi_network_pkt_stats_info::reserved"]
        [::std::mem::offset_of!(dcmi_network_pkt_stats_info, reserved) - 400usize];
};
pub const dcmi_ping_result_DCMI_PING_NOT_START: dcmi_ping_result = 0;
pub const dcmi_ping_result_DCMI_PING_SUCCESS: dcmi_ping_result = 1;
pub const dcmi_ping_result_DCMI_SEND_FAILED: dcmi_ping_result = 2;
pub const dcmi_ping_result_DCMI_RECV_TIMEOUT: dcmi_ping_result = 3;
pub const dcmi_ping_result_DCMI_RES_MAX: dcmi_ping_result = 4;
pub type dcmi_ping_result = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ping_operate_info {
    pub dst_addr: [::std::os::raw::c_char; 16usize],
    pub sdid: ::std::os::raw::c_uint,
    pub packet_size: ::std::os::raw::c_uint,
    pub packet_send_num: ::std::os::raw::c_uint,
    pub packet_interval: ::std::os::raw::c_uint,
    pub timeout: ::std::os::raw::c_uint,
    pub reserved: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ping_operate_info"][::std::mem::size_of::<dcmi_ping_operate_info>() - 68usize];
    ["Alignment of dcmi_ping_operate_info"]
        [::std::mem::align_of::<dcmi_ping_operate_info>() - 4usize];
    ["Offset of field: dcmi_ping_operate_info::dst_addr"]
        [::std::mem::offset_of!(dcmi_ping_operate_info, dst_addr) - 0usize];
    ["Offset of field: dcmi_ping_operate_info::sdid"]
        [::std::mem::offset_of!(dcmi_ping_operate_info, sdid) - 16usize];
    ["Offset of field: dcmi_ping_operate_info::packet_size"]
        [::std::mem::offset_of!(dcmi_ping_operate_info, packet_size) - 20usize];
    ["Offset of field: dcmi_ping_operate_info::packet_send_num"]
        [::std::mem::offset_of!(dcmi_ping_operate_info, packet_send_num) - 24usize];
    ["Offset of field: dcmi_ping_operate_info::packet_interval"]
        [::std::mem::offset_of!(dcmi_ping_operate_info, packet_interval) - 28usize];
    ["Offset of field: dcmi_ping_operate_info::timeout"]
        [::std::mem::offset_of!(dcmi_ping_operate_info, timeout) - 32usize];
    ["Offset of field: dcmi_ping_operate_info::reserved"]
        [::std::mem::offset_of!(dcmi_ping_operate_info, reserved) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ping_reply_info {
    pub dst_addr: [::std::os::raw::c_char; 16usize],
    pub ret: [dcmi_ping_result; 1000usize],
    pub total_packet_send_num: ::std::os::raw::c_uint,
    pub total_packet_recv_num: ::std::os::raw::c_uint,
    pub start_tv_sec: [::std::os::raw::c_long; 1000usize],
    pub start_tv_usec: [::std::os::raw::c_long; 1000usize],
    pub end_tv_sec: [::std::os::raw::c_long; 1000usize],
    pub end_tv_usec: [::std::os::raw::c_long; 1000usize],
    pub reserved: [::std::os::raw::c_uchar; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ping_reply_info"][::std::mem::size_of::<dcmi_ping_reply_info>() - 36056usize];
    ["Alignment of dcmi_ping_reply_info"][::std::mem::align_of::<dcmi_ping_reply_info>() - 8usize];
    ["Offset of field: dcmi_ping_reply_info::dst_addr"]
        [::std::mem::offset_of!(dcmi_ping_reply_info, dst_addr) - 0usize];
    ["Offset of field: dcmi_ping_reply_info::ret"]
        [::std::mem::offset_of!(dcmi_ping_reply_info, ret) - 16usize];
    ["Offset of field: dcmi_ping_reply_info::total_packet_send_num"]
        [::std::mem::offset_of!(dcmi_ping_reply_info, total_packet_send_num) - 4016usize];
    ["Offset of field: dcmi_ping_reply_info::total_packet_recv_num"]
        [::std::mem::offset_of!(dcmi_ping_reply_info, total_packet_recv_num) - 4020usize];
    ["Offset of field: dcmi_ping_reply_info::start_tv_sec"]
        [::std::mem::offset_of!(dcmi_ping_reply_info, start_tv_sec) - 4024usize];
    ["Offset of field: dcmi_ping_reply_info::start_tv_usec"]
        [::std::mem::offset_of!(dcmi_ping_reply_info, start_tv_usec) - 12024usize];
    ["Offset of field: dcmi_ping_reply_info::end_tv_sec"]
        [::std::mem::offset_of!(dcmi_ping_reply_info, end_tv_sec) - 20024usize];
    ["Offset of field: dcmi_ping_reply_info::end_tv_usec"]
        [::std::mem::offset_of!(dcmi_ping_reply_info, end_tv_usec) - 28024usize];
    ["Offset of field: dcmi_ping_reply_info::reserved"]
        [::std::mem::offset_of!(dcmi_ping_reply_info, reserved) - 36024usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_traceroute_info {
    pub max_ttl: ::std::os::raw::c_int,
    pub tos: ::std::os::raw::c_int,
    pub waittime: ::std::os::raw::c_int,
    pub source_port: ::std::os::raw::c_int,
    pub dest_port: ::std::os::raw::c_int,
    pub dest_ip: [::std::os::raw::c_char; 48usize],
    pub ipv6_flag: bool,
    pub reset_flag: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_traceroute_info"][::std::mem::size_of::<dcmi_traceroute_info>() - 72usize];
    ["Alignment of dcmi_traceroute_info"][::std::mem::align_of::<dcmi_traceroute_info>() - 4usize];
    ["Offset of field: dcmi_traceroute_info::max_ttl"]
        [::std::mem::offset_of!(dcmi_traceroute_info, max_ttl) - 0usize];
    ["Offset of field: dcmi_traceroute_info::tos"]
        [::std::mem::offset_of!(dcmi_traceroute_info, tos) - 4usize];
    ["Offset of field: dcmi_traceroute_info::waittime"]
        [::std::mem::offset_of!(dcmi_traceroute_info, waittime) - 8usize];
    ["Offset of field: dcmi_traceroute_info::source_port"]
        [::std::mem::offset_of!(dcmi_traceroute_info, source_port) - 12usize];
    ["Offset of field: dcmi_traceroute_info::dest_port"]
        [::std::mem::offset_of!(dcmi_traceroute_info, dest_port) - 16usize];
    ["Offset of field: dcmi_traceroute_info::dest_ip"]
        [::std::mem::offset_of!(dcmi_traceroute_info, dest_ip) - 20usize];
    ["Offset of field: dcmi_traceroute_info::ipv6_flag"]
        [::std::mem::offset_of!(dcmi_traceroute_info, ipv6_flag) - 68usize];
    ["Offset of field: dcmi_traceroute_info::reset_flag"]
        [::std::mem::offset_of!(dcmi_traceroute_info, reset_flag) - 69usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_network_node_info {
    pub mask: ::std::os::raw::c_int,
    pub ip: [::std::os::raw::c_char; 48usize],
    pub snt: ::std::os::raw::c_int,
    pub loss: f64,
    pub last: f64,
    pub avg: f64,
    pub best: f64,
    pub wrst: f64,
    pub stdev: f64,
    pub reserve: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_network_node_info"][::std::mem::size_of::<dcmi_network_node_info>() - 168usize];
    ["Alignment of dcmi_network_node_info"]
        [::std::mem::align_of::<dcmi_network_node_info>() - 8usize];
    ["Offset of field: dcmi_network_node_info::mask"]
        [::std::mem::offset_of!(dcmi_network_node_info, mask) - 0usize];
    ["Offset of field: dcmi_network_node_info::ip"]
        [::std::mem::offset_of!(dcmi_network_node_info, ip) - 4usize];
    ["Offset of field: dcmi_network_node_info::snt"]
        [::std::mem::offset_of!(dcmi_network_node_info, snt) - 52usize];
    ["Offset of field: dcmi_network_node_info::loss"]
        [::std::mem::offset_of!(dcmi_network_node_info, loss) - 56usize];
    ["Offset of field: dcmi_network_node_info::last"]
        [::std::mem::offset_of!(dcmi_network_node_info, last) - 64usize];
    ["Offset of field: dcmi_network_node_info::avg"]
        [::std::mem::offset_of!(dcmi_network_node_info, avg) - 72usize];
    ["Offset of field: dcmi_network_node_info::best"]
        [::std::mem::offset_of!(dcmi_network_node_info, best) - 80usize];
    ["Offset of field: dcmi_network_node_info::wrst"]
        [::std::mem::offset_of!(dcmi_network_node_info, wrst) - 88usize];
    ["Offset of field: dcmi_network_node_info::stdev"]
        [::std::mem::offset_of!(dcmi_network_node_info, stdev) - 96usize];
    ["Offset of field: dcmi_network_node_info::reserve"]
        [::std::mem::offset_of!(dcmi_network_node_info, reserve) - 104usize];
};
extern "C" {
    pub fn dcmi_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_dcmi_version(
        dcmi_ver: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_driver_version(
        driver_ver: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_card_list(
        card_num: *mut ::std::os::raw::c_int,
        card_list: *mut ::std::os::raw::c_int,
        list_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_num_in_card(
        card_id: ::std::os::raw::c_int,
        device_num: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_id_in_card(
        card_id: ::std::os::raw::c_int,
        device_id_max: *mut ::std::os::raw::c_int,
        mcu_id: *mut ::std::os::raw::c_int,
        cpu_id: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_type(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        device_type: *mut dcmi_unit_type,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_chip_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        chip_info: *mut dcmi_chip_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_pcie_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        pcie_info: *mut dcmi_pcie_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_pcie_info_v2(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        pcie_info: *mut dcmi_pcie_info_all,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_board_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        board_info: *mut dcmi_board_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_elabel_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        elabel_info: *mut dcmi_elabel_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_power_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        power: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_card_customized_info(
        card_id: ::std::os::raw::c_int,
        info: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_card_customized_info(
        card_id: ::std::os::raw::c_int,
        info: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_clear_pcie_error(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_pcie_error_cnt(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        pcie_err_code_info: *mut dcmi_chip_pcie_err_rate,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_die_v2(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        input_type: dcmi_die_type,
        die_id: *mut dcmi_die_id,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_health(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        health: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_errorcode_v2(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        error_count: *mut ::std::os::raw::c_int,
        error_code_list: *mut ::std::os::raw::c_uint,
        list_len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_errorcode_string(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        error_code: ::std::os::raw::c_uint,
        error_info: *mut ::std::os::raw::c_uchar,
        buf_size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_flash_count(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        flash_count: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_flash_info_v2(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        flash_index: ::std::os::raw::c_uint,
        flash_info: *mut dcmi_flash_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_aicore_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        aicore_info: *mut dcmi_aicore_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_aicpu_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        aicpu_info: *mut dcmi_aicpu_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_boot_status(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        boot_status: *mut dcmi_boot_status,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_pre_reset(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_rescan(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_reset(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        channel_type: dcmi_reset_channel,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_mcu_upgrade_status(
        card_id: ::std::os::raw::c_int,
        status: *mut ::std::os::raw::c_int,
        progress: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_mcu_version(
        card_id: ::std::os::raw::c_int,
        version: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_mcu_upgrade_stage(
        card_id: ::std::os::raw::c_int,
        input_type: dcmi_upgrade_type,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_mcu_upgrade_file(
        card_id: ::std::os::raw::c_int,
        file: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_system_time(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        time: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_temperature(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        temperature: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_voltage(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        voltage: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_p2p_enable(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        enable_flag: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_ecc_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        input_type: dcmi_device_type,
        device_ecc_info: *mut dcmi_ecc_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_clear_ecc_statistics_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_frequency(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        input_type: dcmi_freq_type,
        frequency: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_hbm_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        hbm_info: *mut dcmi_hbm_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_memory_info_v2(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        memory_info: *mut dcmi_memory_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_memory_info_v3(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        memory_info: *mut dcmi_get_memory_info_stru,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_utilization_rate(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        input_type: ::std::os::raw::c_int,
        utilization_rate: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_sensor_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        sensor_id: dcmi_manager_sensor_id,
        sensor_info: *mut dcmi_sensor_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_container_service_enable() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_board_id(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        board_id: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_component_count(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        component_count: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_component_list(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        component_table: *mut dcmi_component_type,
        component_count: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_component_static_version(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        component_type: dcmi_component_type,
        version_str: *mut ::std::os::raw::c_uchar,
        len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_cgroup_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        cg_info: *mut dcmi_cgroup_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_llc_perf_para(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        perf_para: *mut dcmi_llc_perf,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        main_cmd: dcmi_main_cmd,
        sub_cmd: ::std::os::raw::c_uint,
        buf: *const ::std::os::raw::c_void,
        buf_size: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        main_cmd: dcmi_main_cmd,
        sub_cmd: ::std::os::raw::c_uint,
        buf: *mut ::std::os::raw::c_void,
        size: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_sec_revocation(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        input_type: dcmi_revo_type,
        file_data: *const ::std::os::raw::c_uchar,
        file_size: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_mac_count(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        count: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_mac(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        mac_id: ::std::os::raw::c_int,
        mac_addr: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_mac(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        mac_id: ::std::os::raw::c_int,
        mac_addr: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_gateway(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        input_type: dcmi_port_type,
        port_id: ::std::os::raw::c_int,
        gateway: *mut dcmi_ip_addr,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_gateway(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        input_type: dcmi_port_type,
        port_id: ::std::os::raw::c_int,
        gateway: *mut dcmi_ip_addr,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_ip(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        input_type: dcmi_port_type,
        port_id: ::std::os::raw::c_int,
        ip: *mut dcmi_ip_addr,
        mask: *mut dcmi_ip_addr,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_ip(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        input_type: dcmi_port_type,
        port_id: ::std::os::raw::c_int,
        ip: *mut dcmi_ip_addr,
        mask: *mut dcmi_ip_addr,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_network_health(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        result: *mut dcmi_rdfx_detect_result,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_fan_count(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        count: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_fan_speed(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        fan_id: ::std::os::raw::c_int,
        speed: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_logic_id(
        device_logic_id: *mut ::std::os::raw::c_int,
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_card_elabel_v2(
        card_id: ::std::os::raw::c_int,
        elabel_info: *mut dcmi_elabel_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_mcu_get_chip_temperature(
        card_id: ::std::os::raw::c_int,
        data_info: *mut ::std::os::raw::c_char,
        buf_size: ::std::os::raw::c_int,
        data_len: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_ssh_enable(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        enable_flag: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_share_enable(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        enable_flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_share_enable(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        enable_flag: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_card_board_info(
        card_id: ::std::os::raw::c_int,
        board_info: *mut dcmi_board_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_card_pcie_info(
        card_id: ::std::os::raw::c_int,
        pcie_info: *mut ::std::os::raw::c_char,
        pcie_info_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_card_pcie_slot(
        card_id: ::std::os::raw::c_int,
        pcie_slot: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_fault_device_num_in_card(
        card_id: ::std::os::raw::c_int,
        device_num: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_mcu_check_i2c(
        card_id: ::std::os::raw::c_int,
        health_status: *mut ::std::os::raw::c_int,
        buf_size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_user_config(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        config_name: *const ::std::os::raw::c_char,
        buf_size: ::std::os::raw::c_uint,
        buf: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_mcu_collect_log(
        card_id: ::std::os::raw::c_int,
        log_type: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_chip_slot(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        chip_pos_id: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_product_type(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        product_type_str: *mut ::std::os::raw::c_char,
        buf_size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_outband_channel_state(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        channel_state: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_aicpu_count_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        count_info: *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_create_vdevice(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        vdev: *mut dcmi_create_vdev_res_stru,
        out: *mut dcmi_create_vdev_out,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_destroy_vdevice(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        vdevid: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_board_id(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        board_id: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_first_power_on_date(
        card_id: ::std::os::raw::c_int,
        first_power_on_date: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_fault_event(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        timeout: ::std::os::raw::c_int,
        filter: dcmi_event_filter,
        event: *mut dcmi_event,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_subscribe_fault_event(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        filter: dcmi_event_filter,
        handler: dcmi_fault_event_callback,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_resource_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        proc_info: *mut dcmi_proc_mem_info,
        proc_num: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_dvpp_ratio_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        usage: *mut dcmi_dvpp_ratio,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_cpu_num_config(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        buf: *mut ::std::os::raw::c_uchar,
        buf_size: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_device_cpu_num_config(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        buf: *mut ::std::os::raw::c_uchar,
        buf_size: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_phyid_from_logicid(
        logicid: ::std::os::raw::c_uint,
        phyid: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_logicid_from_phyid(
        phyid: ::std::os::raw::c_uint,
        logicid: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_card_id_device_id_from_logicid(
        card_id: *mut ::std::os::raw::c_int,
        device_id: *mut ::std::os::raw::c_int,
        device_logic_id: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_card_id_device_id_from_phyid(
        card_id: *mut ::std::os::raw::c_int,
        device_id: *mut ::std::os::raw::c_int,
        device_phy_id: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_vdevice_mode(mode: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_vdevice_mode(mode: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_vnpu_config_recover_mode(mode: ::std::os::raw::c_uint)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_vnpu_config_recover_mode(
        mode: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_driver_health(health: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_driver_errorcode(
        error_count: *mut ::std::os::raw::c_int,
        error_code_list: *mut ::std::os::raw::c_uint,
        list_len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_sm_encrypt(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        parm: *mut dcmi_sm_parm,
        data: *mut dcmi_sm_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_sm_decrypt(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        parm: *mut dcmi_sm_parm,
        data: *mut dcmi_sm_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_npu_work_mode(
        card_id: ::std::os::raw::c_int,
        work_mode: *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_mainboard_id(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        mainboard_id: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_power_state(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        power_info: dcmi_power_state_info_stru,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_device_compatibility(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        compatibility: *mut dcmi_device_compat,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_create_capability_group(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        ts_id: ::std::os::raw::c_int,
        group_info: *mut dcmi_capability_group_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_delete_capability_group(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        ts_id: ::std::os::raw::c_int,
        group_id: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_capability_group_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        ts_id: ::std::os::raw::c_int,
        group_id: ::std::os::raw::c_int,
        group_info: *mut dcmi_capability_group_info,
        group_count: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_capability_group_aicore_usage(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        group_id: ::std::os::raw::c_int,
        rate: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_multi_ecc_time_info(
        card_id: ::std::os::raw::c_int,
        multi_ecc_time_data: *mut dcmi_multi_ecc_time_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_multi_ecc_record_info(
        card_id: ::std::os::raw::c_int,
        ecc_count: *mut ::std::os::raw::c_uint,
        read_type: ::std::os::raw::c_uchar,
        module_type: ::std::os::raw::c_uchar,
        ecc_common_data_s: *mut dcmi_ecc_common_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_pcie_link_bandwidth_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        pcie_link_bandwidth_info: *mut dcmi_pcie_link_bandwidth_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_topo_info_by_device_id(
        card_id1: ::std::os::raw::c_int,
        device_id1: ::std::os::raw::c_int,
        card_id2: ::std::os::raw::c_int,
        device_id2: ::std::os::raw::c_int,
        topo_type: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_affinity_cpu_info_by_device_id(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        affinity_cpu: *mut ::std::os::raw::c_char,
        length: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_multi_ecc_time_info_v2(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        multi_ecc_time_data: *mut dcmi_multi_ecc_time_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_multi_ecc_record_info_v2(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        type_: dcmi_ecc_record_type,
        ecc_count: *mut ::std::os::raw::c_uint,
        ecc_common_data_s: *mut dcmi_ecc_common_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_serdes_quality_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        macro_id: ::std::os::raw::c_uint,
        serdes_quality_info: *mut dcmi_serdes_quality_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_rdma_bandwidth_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        port_id: ::std::os::raw::c_int,
        prof_time: ::std::os::raw::c_uint,
        network_rdma_bandwidth_info: *mut dcmi_network_rdma_bandwidth_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_netdev_pkt_stats_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        port_id: ::std::os::raw::c_int,
        network_pkt_stats_info: *mut dcmi_network_pkt_stats_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_ping_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        port_id: ::std::os::raw::c_int,
        dcmi_ping: *mut dcmi_ping_operate_info,
        dcmi_reply: *mut dcmi_ping_reply_info,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_set_traceroute(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        param_in: dcmi_traceroute_info,
        ret_info: *mut dcmi_network_node_info,
        ret_info_size: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_tag_pcie_idinfo {
    pub deviceid: ::std::os::raw::c_uint,
    pub venderid: ::std::os::raw::c_uint,
    pub subvenderid: ::std::os::raw::c_uint,
    pub subdeviceid: ::std::os::raw::c_uint,
    pub bdf_deviceid: ::std::os::raw::c_uint,
    pub bdf_busid: ::std::os::raw::c_uint,
    pub bdf_funcid: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_tag_pcie_idinfo"][::std::mem::size_of::<dcmi_tag_pcie_idinfo>() - 28usize];
    ["Alignment of dcmi_tag_pcie_idinfo"][::std::mem::align_of::<dcmi_tag_pcie_idinfo>() - 4usize];
    ["Offset of field: dcmi_tag_pcie_idinfo::deviceid"]
        [::std::mem::offset_of!(dcmi_tag_pcie_idinfo, deviceid) - 0usize];
    ["Offset of field: dcmi_tag_pcie_idinfo::venderid"]
        [::std::mem::offset_of!(dcmi_tag_pcie_idinfo, venderid) - 4usize];
    ["Offset of field: dcmi_tag_pcie_idinfo::subvenderid"]
        [::std::mem::offset_of!(dcmi_tag_pcie_idinfo, subvenderid) - 8usize];
    ["Offset of field: dcmi_tag_pcie_idinfo::subdeviceid"]
        [::std::mem::offset_of!(dcmi_tag_pcie_idinfo, subdeviceid) - 12usize];
    ["Offset of field: dcmi_tag_pcie_idinfo::bdf_deviceid"]
        [::std::mem::offset_of!(dcmi_tag_pcie_idinfo, bdf_deviceid) - 16usize];
    ["Offset of field: dcmi_tag_pcie_idinfo::bdf_busid"]
        [::std::mem::offset_of!(dcmi_tag_pcie_idinfo, bdf_busid) - 20usize];
    ["Offset of field: dcmi_tag_pcie_idinfo::bdf_funcid"]
        [::std::mem::offset_of!(dcmi_tag_pcie_idinfo, bdf_funcid) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_board_info_stru {
    pub board_id: ::std::os::raw::c_uint,
    pub pcb_id: ::std::os::raw::c_uint,
    pub bom_id: ::std::os::raw::c_uint,
    pub slot_id: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_board_info_stru"][::std::mem::size_of::<dcmi_board_info_stru>() - 16usize];
    ["Alignment of dcmi_board_info_stru"][::std::mem::align_of::<dcmi_board_info_stru>() - 4usize];
    ["Offset of field: dcmi_board_info_stru::board_id"]
        [::std::mem::offset_of!(dcmi_board_info_stru, board_id) - 0usize];
    ["Offset of field: dcmi_board_info_stru::pcb_id"]
        [::std::mem::offset_of!(dcmi_board_info_stru, pcb_id) - 4usize];
    ["Offset of field: dcmi_board_info_stru::bom_id"]
        [::std::mem::offset_of!(dcmi_board_info_stru, bom_id) - 8usize];
    ["Offset of field: dcmi_board_info_stru::slot_id"]
        [::std::mem::offset_of!(dcmi_board_info_stru, slot_id) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_elabel_info_stru {
    pub product_name: [::std::os::raw::c_char; 256usize],
    pub model: [::std::os::raw::c_char; 256usize],
    pub manufacturer: [::std::os::raw::c_char; 256usize],
    pub serial_number: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_elabel_info_stru"][::std::mem::size_of::<dcmi_elabel_info_stru>() - 1024usize];
    ["Alignment of dcmi_elabel_info_stru"]
        [::std::mem::align_of::<dcmi_elabel_info_stru>() - 1usize];
    ["Offset of field: dcmi_elabel_info_stru::product_name"]
        [::std::mem::offset_of!(dcmi_elabel_info_stru, product_name) - 0usize];
    ["Offset of field: dcmi_elabel_info_stru::model"]
        [::std::mem::offset_of!(dcmi_elabel_info_stru, model) - 256usize];
    ["Offset of field: dcmi_elabel_info_stru::manufacturer"]
        [::std::mem::offset_of!(dcmi_elabel_info_stru, manufacturer) - 512usize];
    ["Offset of field: dcmi_elabel_info_stru::serial_number"]
        [::std::mem::offset_of!(dcmi_elabel_info_stru, serial_number) - 768usize];
};
pub type DCMI_ELABEL_INFO_STRU = dcmi_elabel_info_stru;
pub type PDCMI_ELABEL_INFO_STRU = *mut dcmi_elabel_info_stru;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_chip_pcie_err_rate_stru {
    pub reg_deskew_fifo_overflow_intr_status: ::std::os::raw::c_uint,
    pub reg_symbol_unlock_intr_status: ::std::os::raw::c_uint,
    pub reg_deskew_unlock_intr_status: ::std::os::raw::c_uint,
    pub reg_phystatus_timeout_intr_status: ::std::os::raw::c_uint,
    pub symbol_unlock_counter: ::std::os::raw::c_uint,
    pub pcs_rx_err_cnt: ::std::os::raw::c_uint,
    pub phy_lane_err_counter: ::std::os::raw::c_uint,
    pub pcs_rcv_err_status: ::std::os::raw::c_uint,
    pub symbol_unlock_err_status: ::std::os::raw::c_uint,
    pub phy_lane_err_status: ::std::os::raw::c_uint,
    pub dl_lcrc_err_num: ::std::os::raw::c_uint,
    pub dl_dcrc_err_num: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_chip_pcie_err_rate_stru"]
        [::std::mem::size_of::<dcmi_chip_pcie_err_rate_stru>() - 48usize];
    ["Alignment of dcmi_chip_pcie_err_rate_stru"]
        [::std::mem::align_of::<dcmi_chip_pcie_err_rate_stru>() - 4usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::reg_deskew_fifo_overflow_intr_status"][::std::mem::offset_of!(
        dcmi_chip_pcie_err_rate_stru,
        reg_deskew_fifo_overflow_intr_status
    )
        - 0usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::reg_symbol_unlock_intr_status"][::std::mem::offset_of!(
        dcmi_chip_pcie_err_rate_stru,
        reg_symbol_unlock_intr_status
    ) - 4usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::reg_deskew_unlock_intr_status"][::std::mem::offset_of!(
        dcmi_chip_pcie_err_rate_stru,
        reg_deskew_unlock_intr_status
    ) - 8usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::reg_phystatus_timeout_intr_status"][::std::mem::offset_of!(
        dcmi_chip_pcie_err_rate_stru,
        reg_phystatus_timeout_intr_status
    )
        - 12usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::symbol_unlock_counter"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate_stru, symbol_unlock_counter) - 16usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::pcs_rx_err_cnt"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate_stru, pcs_rx_err_cnt) - 20usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::phy_lane_err_counter"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate_stru, phy_lane_err_counter) - 24usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::pcs_rcv_err_status"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate_stru, pcs_rcv_err_status) - 28usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::symbol_unlock_err_status"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate_stru, symbol_unlock_err_status) - 32usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::phy_lane_err_status"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate_stru, phy_lane_err_status) - 36usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::dl_lcrc_err_num"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate_stru, dl_lcrc_err_num) - 40usize];
    ["Offset of field: dcmi_chip_pcie_err_rate_stru::dl_dcrc_err_num"]
        [::std::mem::offset_of!(dcmi_chip_pcie_err_rate_stru, dl_dcrc_err_num) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_soc_die_stru {
    pub soc_die: [::std::os::raw::c_uint; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_soc_die_stru"][::std::mem::size_of::<dcmi_soc_die_stru>() - 20usize];
    ["Alignment of dcmi_soc_die_stru"][::std::mem::align_of::<dcmi_soc_die_stru>() - 4usize];
    ["Offset of field: dcmi_soc_die_stru::soc_die"]
        [::std::mem::offset_of!(dcmi_soc_die_stru, soc_die) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_flash_info_stru {
    pub flash_id: ::std::os::raw::c_ulonglong,
    pub device_id: ::std::os::raw::c_ushort,
    pub vendor: ::std::os::raw::c_ushort,
    pub state: ::std::os::raw::c_uint,
    pub size: ::std::os::raw::c_ulonglong,
    pub sector_count: ::std::os::raw::c_uint,
    pub manufacturer_id: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_flash_info_stru"][::std::mem::size_of::<dcmi_flash_info_stru>() - 32usize];
    ["Alignment of dcmi_flash_info_stru"][::std::mem::align_of::<dcmi_flash_info_stru>() - 8usize];
    ["Offset of field: dcmi_flash_info_stru::flash_id"]
        [::std::mem::offset_of!(dcmi_flash_info_stru, flash_id) - 0usize];
    ["Offset of field: dcmi_flash_info_stru::device_id"]
        [::std::mem::offset_of!(dcmi_flash_info_stru, device_id) - 8usize];
    ["Offset of field: dcmi_flash_info_stru::vendor"]
        [::std::mem::offset_of!(dcmi_flash_info_stru, vendor) - 10usize];
    ["Offset of field: dcmi_flash_info_stru::state"]
        [::std::mem::offset_of!(dcmi_flash_info_stru, state) - 12usize];
    ["Offset of field: dcmi_flash_info_stru::size"]
        [::std::mem::offset_of!(dcmi_flash_info_stru, size) - 16usize];
    ["Offset of field: dcmi_flash_info_stru::sector_count"]
        [::std::mem::offset_of!(dcmi_flash_info_stru, sector_count) - 24usize];
    ["Offset of field: dcmi_flash_info_stru::manufacturer_id"]
        [::std::mem::offset_of!(dcmi_flash_info_stru, manufacturer_id) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_ecc_info_stru {
    pub enable_flag: ::std::os::raw::c_int,
    pub single_bit_error_count: ::std::os::raw::c_uint,
    pub double_bit_error_count: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_ecc_info_stru"][::std::mem::size_of::<dcmi_ecc_info_stru>() - 12usize];
    ["Alignment of dcmi_ecc_info_stru"][::std::mem::align_of::<dcmi_ecc_info_stru>() - 4usize];
    ["Offset of field: dcmi_ecc_info_stru::enable_flag"]
        [::std::mem::offset_of!(dcmi_ecc_info_stru, enable_flag) - 0usize];
    ["Offset of field: dcmi_ecc_info_stru::single_bit_error_count"]
        [::std::mem::offset_of!(dcmi_ecc_info_stru, single_bit_error_count) - 4usize];
    ["Offset of field: dcmi_ecc_info_stru::double_bit_error_count"]
        [::std::mem::offset_of!(dcmi_ecc_info_stru, double_bit_error_count) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dcmi_memory_info_stru {
    pub memory_size: ::std::os::raw::c_ulonglong,
    pub freq: ::std::os::raw::c_uint,
    pub utiliza: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dcmi_memory_info_stru"][::std::mem::size_of::<dcmi_memory_info_stru>() - 16usize];
    ["Alignment of dcmi_memory_info_stru"]
        [::std::mem::align_of::<dcmi_memory_info_stru>() - 8usize];
    ["Offset of field: dcmi_memory_info_stru::memory_size"]
        [::std::mem::offset_of!(dcmi_memory_info_stru, memory_size) - 0usize];
    ["Offset of field: dcmi_memory_info_stru::freq"]
        [::std::mem::offset_of!(dcmi_memory_info_stru, freq) - 8usize];
    ["Offset of field: dcmi_memory_info_stru::utiliza"]
        [::std::mem::offset_of!(dcmi_memory_info_stru, utiliza) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsmi_soc_die_stru {
    pub soc_die: [::std::os::raw::c_uint; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_soc_die_stru"][::std::mem::size_of::<dsmi_soc_die_stru>() - 20usize];
    ["Alignment of dsmi_soc_die_stru"][::std::mem::align_of::<dsmi_soc_die_stru>() - 4usize];
    ["Offset of field: dsmi_soc_die_stru::soc_die"]
        [::std::mem::offset_of!(dsmi_soc_die_stru, soc_die) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsmi_board_info_stru {
    pub board_id: ::std::os::raw::c_uint,
    pub pcb_id: ::std::os::raw::c_uint,
    pub bom_id: ::std::os::raw::c_uint,
    pub slot_id: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_board_info_stru"][::std::mem::size_of::<dsmi_board_info_stru>() - 16usize];
    ["Alignment of dsmi_board_info_stru"][::std::mem::align_of::<dsmi_board_info_stru>() - 4usize];
    ["Offset of field: dsmi_board_info_stru::board_id"]
        [::std::mem::offset_of!(dsmi_board_info_stru, board_id) - 0usize];
    ["Offset of field: dsmi_board_info_stru::pcb_id"]
        [::std::mem::offset_of!(dsmi_board_info_stru, pcb_id) - 4usize];
    ["Offset of field: dsmi_board_info_stru::bom_id"]
        [::std::mem::offset_of!(dsmi_board_info_stru, bom_id) - 8usize];
    ["Offset of field: dsmi_board_info_stru::slot_id"]
        [::std::mem::offset_of!(dsmi_board_info_stru, slot_id) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tag_pcie_idinfo {
    pub deviceid: ::std::os::raw::c_uint,
    pub venderid: ::std::os::raw::c_uint,
    pub subvenderid: ::std::os::raw::c_uint,
    pub subdeviceid: ::std::os::raw::c_uint,
    pub bdf_deviceid: ::std::os::raw::c_uint,
    pub bdf_busid: ::std::os::raw::c_uint,
    pub bdf_funcid: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tag_pcie_idinfo"][::std::mem::size_of::<tag_pcie_idinfo>() - 28usize];
    ["Alignment of tag_pcie_idinfo"][::std::mem::align_of::<tag_pcie_idinfo>() - 4usize];
    ["Offset of field: tag_pcie_idinfo::deviceid"]
        [::std::mem::offset_of!(tag_pcie_idinfo, deviceid) - 0usize];
    ["Offset of field: tag_pcie_idinfo::venderid"]
        [::std::mem::offset_of!(tag_pcie_idinfo, venderid) - 4usize];
    ["Offset of field: tag_pcie_idinfo::subvenderid"]
        [::std::mem::offset_of!(tag_pcie_idinfo, subvenderid) - 8usize];
    ["Offset of field: tag_pcie_idinfo::subdeviceid"]
        [::std::mem::offset_of!(tag_pcie_idinfo, subdeviceid) - 12usize];
    ["Offset of field: tag_pcie_idinfo::bdf_deviceid"]
        [::std::mem::offset_of!(tag_pcie_idinfo, bdf_deviceid) - 16usize];
    ["Offset of field: tag_pcie_idinfo::bdf_busid"]
        [::std::mem::offset_of!(tag_pcie_idinfo, bdf_busid) - 20usize];
    ["Offset of field: tag_pcie_idinfo::bdf_funcid"]
        [::std::mem::offset_of!(tag_pcie_idinfo, bdf_funcid) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dm_flash_info_stru {
    pub flash_id: ::std::os::raw::c_ulong,
    pub device_id: ::std::os::raw::c_ushort,
    pub vendor: ::std::os::raw::c_ushort,
    pub state: ::std::os::raw::c_uint,
    pub size: ::std::os::raw::c_ulong,
    pub sector_count: ::std::os::raw::c_uint,
    pub manufacturer_id: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dm_flash_info_stru"][::std::mem::size_of::<dm_flash_info_stru>() - 32usize];
    ["Alignment of dm_flash_info_stru"][::std::mem::align_of::<dm_flash_info_stru>() - 8usize];
    ["Offset of field: dm_flash_info_stru::flash_id"]
        [::std::mem::offset_of!(dm_flash_info_stru, flash_id) - 0usize];
    ["Offset of field: dm_flash_info_stru::device_id"]
        [::std::mem::offset_of!(dm_flash_info_stru, device_id) - 8usize];
    ["Offset of field: dm_flash_info_stru::vendor"]
        [::std::mem::offset_of!(dm_flash_info_stru, vendor) - 10usize];
    ["Offset of field: dm_flash_info_stru::state"]
        [::std::mem::offset_of!(dm_flash_info_stru, state) - 12usize];
    ["Offset of field: dm_flash_info_stru::size"]
        [::std::mem::offset_of!(dm_flash_info_stru, size) - 16usize];
    ["Offset of field: dm_flash_info_stru::sector_count"]
        [::std::mem::offset_of!(dm_flash_info_stru, sector_count) - 24usize];
    ["Offset of field: dm_flash_info_stru::manufacturer_id"]
        [::std::mem::offset_of!(dm_flash_info_stru, manufacturer_id) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsmi_aicore_info_stru {
    pub freq: ::std::os::raw::c_uint,
    pub curfreq: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_aicore_info_stru"][::std::mem::size_of::<dsmi_aicore_info_stru>() - 8usize];
    ["Alignment of dsmi_aicore_info_stru"]
        [::std::mem::align_of::<dsmi_aicore_info_stru>() - 4usize];
    ["Offset of field: dsmi_aicore_info_stru::freq"]
        [::std::mem::offset_of!(dsmi_aicore_info_stru, freq) - 0usize];
    ["Offset of field: dsmi_aicore_info_stru::curfreq"]
        [::std::mem::offset_of!(dsmi_aicore_info_stru, curfreq) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsmi_aicpu_info_stru {
    pub maxFreq: ::std::os::raw::c_uint,
    pub curFreq: ::std::os::raw::c_uint,
    pub aicpuNum: ::std::os::raw::c_uint,
    pub utilRate: [::std::os::raw::c_uint; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_aicpu_info_stru"][::std::mem::size_of::<dsmi_aicpu_info_stru>() - 76usize];
    ["Alignment of dsmi_aicpu_info_stru"][::std::mem::align_of::<dsmi_aicpu_info_stru>() - 4usize];
    ["Offset of field: dsmi_aicpu_info_stru::maxFreq"]
        [::std::mem::offset_of!(dsmi_aicpu_info_stru, maxFreq) - 0usize];
    ["Offset of field: dsmi_aicpu_info_stru::curFreq"]
        [::std::mem::offset_of!(dsmi_aicpu_info_stru, curFreq) - 4usize];
    ["Offset of field: dsmi_aicpu_info_stru::aicpuNum"]
        [::std::mem::offset_of!(dsmi_aicpu_info_stru, aicpuNum) - 8usize];
    ["Offset of field: dsmi_aicpu_info_stru::utilRate"]
        [::std::mem::offset_of!(dsmi_aicpu_info_stru, utilRate) - 12usize];
};
pub type DSMI_AICPU_INFO = dsmi_aicpu_info_stru;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsmi_ecc_info_stru {
    pub enable_flag: ::std::os::raw::c_int,
    pub single_bit_error_count: ::std::os::raw::c_uint,
    pub double_bit_error_count: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_ecc_info_stru"][::std::mem::size_of::<dsmi_ecc_info_stru>() - 12usize];
    ["Alignment of dsmi_ecc_info_stru"][::std::mem::align_of::<dsmi_ecc_info_stru>() - 4usize];
    ["Offset of field: dsmi_ecc_info_stru::enable_flag"]
        [::std::mem::offset_of!(dsmi_ecc_info_stru, enable_flag) - 0usize];
    ["Offset of field: dsmi_ecc_info_stru::single_bit_error_count"]
        [::std::mem::offset_of!(dsmi_ecc_info_stru, single_bit_error_count) - 4usize];
    ["Offset of field: dsmi_ecc_info_stru::double_bit_error_count"]
        [::std::mem::offset_of!(dsmi_ecc_info_stru, double_bit_error_count) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsmi_ecc_pages_stru {
    pub corrected_ecc_errors_aggregate_total: ::std::os::raw::c_uint,
    pub uncorrected_ecc_errors_aggregate_total: ::std::os::raw::c_uint,
    pub isolated_pages_single_bit_error: ::std::os::raw::c_uint,
    pub isolated_pages_double_bit_error: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_ecc_pages_stru"][::std::mem::size_of::<dsmi_ecc_pages_stru>() - 16usize];
    ["Alignment of dsmi_ecc_pages_stru"][::std::mem::align_of::<dsmi_ecc_pages_stru>() - 4usize];
    ["Offset of field: dsmi_ecc_pages_stru::corrected_ecc_errors_aggregate_total"][::std::mem::offset_of!(
        dsmi_ecc_pages_stru,
        corrected_ecc_errors_aggregate_total
    ) - 0usize];
    ["Offset of field: dsmi_ecc_pages_stru::uncorrected_ecc_errors_aggregate_total"][::std::mem::offset_of!(
        dsmi_ecc_pages_stru,
        uncorrected_ecc_errors_aggregate_total
    ) - 4usize];
    ["Offset of field: dsmi_ecc_pages_stru::isolated_pages_single_bit_error"]
        [::std::mem::offset_of!(dsmi_ecc_pages_stru, isolated_pages_single_bit_error) - 8usize];
    ["Offset of field: dsmi_ecc_pages_stru::isolated_pages_double_bit_error"]
        [::std::mem::offset_of!(dsmi_ecc_pages_stru, isolated_pages_double_bit_error) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsmi_hbm_info_stru {
    #[doc = "< HBM total size, KB"]
    pub memory_size: ::std::os::raw::c_ulonglong,
    #[doc = "< HBM freq, MHZ"]
    pub freq: ::std::os::raw::c_uint,
    #[doc = "< HBM memory_usage, KB"]
    pub memory_usage: ::std::os::raw::c_ulonglong,
    #[doc = "< HBM temperature"]
    pub temp: ::std::os::raw::c_int,
    pub bandwith_util_rate: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_hbm_info_stru"][::std::mem::size_of::<dsmi_hbm_info_stru>() - 32usize];
    ["Alignment of dsmi_hbm_info_stru"][::std::mem::align_of::<dsmi_hbm_info_stru>() - 8usize];
    ["Offset of field: dsmi_hbm_info_stru::memory_size"]
        [::std::mem::offset_of!(dsmi_hbm_info_stru, memory_size) - 0usize];
    ["Offset of field: dsmi_hbm_info_stru::freq"]
        [::std::mem::offset_of!(dsmi_hbm_info_stru, freq) - 8usize];
    ["Offset of field: dsmi_hbm_info_stru::memory_usage"]
        [::std::mem::offset_of!(dsmi_hbm_info_stru, memory_usage) - 16usize];
    ["Offset of field: dsmi_hbm_info_stru::temp"]
        [::std::mem::offset_of!(dsmi_hbm_info_stru, temp) - 24usize];
    ["Offset of field: dsmi_hbm_info_stru::bandwith_util_rate"]
        [::std::mem::offset_of!(dsmi_hbm_info_stru, bandwith_util_rate) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsmi_memory_info_stru {
    pub memory_size: ::std::os::raw::c_ulonglong,
    pub freq: ::std::os::raw::c_uint,
    pub utiliza: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_memory_info_stru"][::std::mem::size_of::<dsmi_memory_info_stru>() - 16usize];
    ["Alignment of dsmi_memory_info_stru"]
        [::std::mem::align_of::<dsmi_memory_info_stru>() - 8usize];
    ["Offset of field: dsmi_memory_info_stru::memory_size"]
        [::std::mem::offset_of!(dsmi_memory_info_stru, memory_size) - 0usize];
    ["Offset of field: dsmi_memory_info_stru::freq"]
        [::std::mem::offset_of!(dsmi_memory_info_stru, freq) - 8usize];
    ["Offset of field: dsmi_memory_info_stru::utiliza"]
        [::std::mem::offset_of!(dsmi_memory_info_stru, utiliza) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dsmi_computing_power_info {
    pub data1: ::std::os::raw::c_uint,
    pub reserve: [::std::os::raw::c_uint; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_computing_power_info"]
        [::std::mem::size_of::<dsmi_computing_power_info>() - 16usize];
    ["Alignment of dsmi_computing_power_info"]
        [::std::mem::align_of::<dsmi_computing_power_info>() - 4usize];
    ["Offset of field: dsmi_computing_power_info::data1"]
        [::std::mem::offset_of!(dsmi_computing_power_info, data1) - 0usize];
    ["Offset of field: dsmi_computing_power_info::reserve"]
        [::std::mem::offset_of!(dsmi_computing_power_info, reserve) - 4usize];
};
pub const dsmi_event_type_DMS_FAULT_EVENT: dsmi_event_type = 0;
pub const dsmi_event_type_DSMI_EVENT_TYPE_MAX: dsmi_event_type = 1;
pub type dsmi_event_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dms_fault_event {
    pub event_id: ::std::os::raw::c_uint,
    pub deviceid: ::std::os::raw::c_ushort,
    pub node_type: ::std::os::raw::c_uchar,
    pub node_id: ::std::os::raw::c_uchar,
    pub sub_node_type: ::std::os::raw::c_uchar,
    pub sub_node_id: ::std::os::raw::c_uchar,
    pub severity: ::std::os::raw::c_uchar,
    pub assertion: ::std::os::raw::c_uchar,
    pub event_serial_num: ::std::os::raw::c_int,
    pub notify_serial_num: ::std::os::raw::c_int,
    pub alarm_raised_time: ::std::os::raw::c_ulonglong,
    pub event_name: [::std::os::raw::c_char; 256usize],
    pub additional_info: [::std::os::raw::c_char; 32usize],
    pub os_id: ::std::os::raw::c_uchar,
    #[doc = "< os_id occupy 1 byte, reserve 31byte"]
    pub resv: [::std::os::raw::c_uchar; 31usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dms_fault_event"][::std::mem::size_of::<dms_fault_event>() - 352usize];
    ["Alignment of dms_fault_event"][::std::mem::align_of::<dms_fault_event>() - 8usize];
    ["Offset of field: dms_fault_event::event_id"]
        [::std::mem::offset_of!(dms_fault_event, event_id) - 0usize];
    ["Offset of field: dms_fault_event::deviceid"]
        [::std::mem::offset_of!(dms_fault_event, deviceid) - 4usize];
    ["Offset of field: dms_fault_event::node_type"]
        [::std::mem::offset_of!(dms_fault_event, node_type) - 6usize];
    ["Offset of field: dms_fault_event::node_id"]
        [::std::mem::offset_of!(dms_fault_event, node_id) - 7usize];
    ["Offset of field: dms_fault_event::sub_node_type"]
        [::std::mem::offset_of!(dms_fault_event, sub_node_type) - 8usize];
    ["Offset of field: dms_fault_event::sub_node_id"]
        [::std::mem::offset_of!(dms_fault_event, sub_node_id) - 9usize];
    ["Offset of field: dms_fault_event::severity"]
        [::std::mem::offset_of!(dms_fault_event, severity) - 10usize];
    ["Offset of field: dms_fault_event::assertion"]
        [::std::mem::offset_of!(dms_fault_event, assertion) - 11usize];
    ["Offset of field: dms_fault_event::event_serial_num"]
        [::std::mem::offset_of!(dms_fault_event, event_serial_num) - 12usize];
    ["Offset of field: dms_fault_event::notify_serial_num"]
        [::std::mem::offset_of!(dms_fault_event, notify_serial_num) - 16usize];
    ["Offset of field: dms_fault_event::alarm_raised_time"]
        [::std::mem::offset_of!(dms_fault_event, alarm_raised_time) - 24usize];
    ["Offset of field: dms_fault_event::event_name"]
        [::std::mem::offset_of!(dms_fault_event, event_name) - 32usize];
    ["Offset of field: dms_fault_event::additional_info"]
        [::std::mem::offset_of!(dms_fault_event, additional_info) - 288usize];
    ["Offset of field: dms_fault_event::os_id"]
        [::std::mem::offset_of!(dms_fault_event, os_id) - 320usize];
    ["Offset of field: dms_fault_event::resv"]
        [::std::mem::offset_of!(dms_fault_event, resv) - 321usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dsmi_event {
    pub type_: dsmi_event_type,
    pub event_t: dsmi_event__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dsmi_event__bindgen_ty_1 {
    pub dms_event: dms_fault_event,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_event__bindgen_ty_1"]
        [::std::mem::size_of::<dsmi_event__bindgen_ty_1>() - 352usize];
    ["Alignment of dsmi_event__bindgen_ty_1"]
        [::std::mem::align_of::<dsmi_event__bindgen_ty_1>() - 8usize];
    ["Offset of field: dsmi_event__bindgen_ty_1::dms_event"]
        [::std::mem::offset_of!(dsmi_event__bindgen_ty_1, dms_event) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dsmi_event"][::std::mem::size_of::<dsmi_event>() - 360usize];
    ["Alignment of dsmi_event"][::std::mem::align_of::<dsmi_event>() - 8usize];
    ["Offset of field: dsmi_event::type_"][::std::mem::offset_of!(dsmi_event, type_) - 0usize];
    ["Offset of field: dsmi_event::event_t"][::std::mem::offset_of!(dsmi_event, event_t) - 8usize];
};
pub type fault_event_callback = ::std::option::Option<unsafe extern "C" fn(event: *mut dsmi_event)>;
extern "C" {
    pub fn dcmi_get_card_num_list(
        card_num: *mut ::std::os::raw::c_int,
        card_list: *mut ::std::os::raw::c_int,
        list_len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_pcie_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        pcie_idinfo: *mut dcmi_tag_pcie_idinfo,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_board_info(
        card_id: ::std::os::raw::c_int,
        device_id: ::std::os::raw::c_int,
        board_info: *mut dcmi_board_info_stru,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dcmi_get_card_elabel(
        card_id: ::std::os::raw::c_int,
        elabel_info: *mut dcmi_elabel_info_stru,
    ) -> ::std::os::raw::c_int;
}
